using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Windows.Forms;
using System.IO;
using System.Collections;

namespace MyTest
{
    public partial class TestTitle : Form
    {
        public TestTitle()
        {
            temuser = Properties.Settings.Default.username;
            addr2 = Application.StartupPath + "\\data\\" + temuser + ".ini";
            InitializeComponent();
            ReadIni2();


            open1 = DateTime.Now;
 

            fuzhixz();
            panel1.BackColor = Color.Transparent;
            panel2.BackColor = Color.Transparent;
            panel3.BackColor = Color.Transparent;
            panel4.BackColor = Color.Transparent;
            panel5.BackColor = Color.Transparent;
            panel6.BackColor = Color.Transparent;
            panel7.BackColor = Color.Transparent;
            panel8.BackColor = Color.Transparent;
            panel9.BackColor = Color.Transparent;
            panel10.BackColor = Color.Transparent;
            panel11.BackColor = Color.Transparent;
            panel12.BackColor = Color.Transparent;
            panel13.BackColor = Color.Transparent;
            panel14.BackColor = Color.Transparent;
            panel15.BackColor = Color.Transparent;
            panel16.BackColor = Color.Transparent;
            panel17.BackColor = Color.Transparent;
            panel18.BackColor = Color.Transparent;
            panel19.BackColor = Color.Transparent;
            panel20.BackColor = Color.Transparent;
            panel21.BackColor = Color.Transparent;
            panel22.BackColor = Color.Transparent;
            panel23.BackColor = Color.Transparent;
            panel24.BackColor = Color.Transparent;
            panel25.BackColor = Color.Transparent;
            panel26.BackColor = Color.Transparent;
            panel27.BackColor = Color.Transparent;
            panel28.BackColor = Color.Transparent;
            panel29.BackColor = Color.Transparent;
            panel30.BackColor = Color.Transparent;
            panel31.BackColor = Color.Transparent;
            panel32.BackColor = Color.Transparent;
            panel33.BackColor = Color.Transparent;
            addr = Application.StartupPath + "\\data\\" + Properties.Settings.Default.username + "_" + flag11 + ".ini";

            labelname.Text = Properties.Settings.Default.username;
       
            selecttimu();
            read_ini();
            if (Properties.Settings.Default.numtitle == 11)
            {  for (int i = 0; i < 45; i++)
                { jilu[i] = ""; }
                jilu[45] = "0";
            }
            if ("1".Equals(jilu[0]))
                c1.Checked = true;
            if ("2".Equals(jilu[0]))
                c2.Checked = true;
            if ("3".Equals(jilu[0]))
                c3.Checked = true;
            if ("4".Equals(jilu[0]))
                c4.Checked = true;

            if ("1".Equals(jilu[45]))//提交后
            { 
                panel31.Enabled = false;
                c1.AutoCheck = false;
                c2.AutoCheck = false;
                c3.AutoCheck = false;
                c4.AutoCheck = false;
                textBox1.ReadOnly = true;
                textBox2.ReadOnly = true;
                textBox3.ReadOnly = true;
                textBox4.ReadOnly = true;
                label31.Visible = true;

                showanswer();
                pddc();

            }

          /*  Label[] lab = { label1, label2, label3, label4, label5, label6, label7, label8, label9, label10, label11, label12, label13, label14, label15, 
                              label16, label17, label18, label19, label20 
                          , label21, label22, label23, label24, label25, label26, label27, label28, label9, label30 };*/

           // MessageBox.Show(zqpddaan.Length.ToString());

        }
   

        //填空题题目
        String[] tiankong ={"26.国家秘密是关系国家______和_____,依照法定程序确定，在一定时间内只限_____的人员知悉的事项。","27.保守国家秘密的工作，实行_____、_____ 、_____的方针。","28.加强和改进保密工作的总体要求的基本原则，应坚持_____、_____、综合防范、创新驱动。",
                               "29.新修订《中华人民共和国保守国家秘密法》自_____年10月1日起施行。","30._____是党中央统一领导党政军保密工作的领导机构。",
                         "26._____主管全国的保密工作。","27._____级国家秘密是最重要的国家秘密，泄露会使国家安全和利益遭受特别严重的损害。","28.各级国家机关、单位对所产生的国家秘密事项，应当按照_____及其_____的规定确定密级。","29.定密责任人在职权范围内承担有关国家秘密的_____、_____和_____工作。","30.摘录、引用密件中属于国家秘密的内容，应当以其中_____和_____作出标识。",
                         "26.保守国家秘密是我国公民的一项_____。","27.涉密人员是指工作中接触、知悉、管理和掌握_____的工作人员。","28.涉密人员上岗前要经过_____和_____。",
                          "29.涉密人员脱离涉密岗位必须进行脱密期管理，其中核心涉密人员脱密期为_____年，重要涉密人员为_____年，一般涉密人员为_____年。","30.从事弹道导弹、核武器、军用核动力、核潜艇等装备的核心技术专家脱密期不少于_____年。",
                          "26.涉密人员脱离涉密岗位前，必须清退管理、使用的全部国家秘密载体并签订_____。",
                          "27.国家秘密载体保密期限需要延长的，由_____和_____的机关、单位或者上级机关决定。","28.禁止在普通手机通话、发送短信息、社交媒体通信过程中，通过明语或暗语谈论、传递_____。","29.不得在连接互联网的计算机上存储、_____、_____国家秘密信息。","30.不准通过普通邮政、快递等无保密措施的方式传递属于国家秘密的_____、_____和_____。",
                          "26.涉密人员因公携带_____外出，应当符合国家保密规定，并采取可靠的保密措施。","27.销毁国家秘密载体，应当采用_____或者_____的方法彻底销毁，确保信息无法还原。","28.不得在涉密计算机和非涉密计算机上_____使用移动存储介质。","29._____使用普通传真机和一体机传输涉密信息。","30.涉密信息系统不得直接或者间接连接国际互联网，必须实行_____。",
                          "26.涉密计算机的密级应按照存储和_____信息的_____确定。","27.计算机一旦存储和处理过涉密信息，就应当确定为_____，并粘贴相关密级标识。","28.未经审批的涉密信息系统，在试运行期间不能存储和处理_____。","29.未经本单位_____管理部门批准，不得自行对涉密计算机进行格式化并重装系统操作。","30.涉密办公自动化设备现场维修时，应由有关人员全程_____陪同。",
                          "26.存储在涉密计算机或者存储介质中的电子文件，只要内容涉密，就应当_____。","27.机密级涉密计算机的系统登录如采用用户名加口令的方式，则系统口令更换周期不得长于_____。","28.绝密级计算机采用_____口令或者_____身份鉴别措施。","29.符合国家保密要求的涉密计算机屏幕保护程序启动时间要求是不超过_____。","30.高密级的涉密移动存储介质_____在_____的涉密计算机上使用。",
                          "26.携带涉密计算机和存储介质外出应当履行_____。","27.携带涉密计算机和存储介质外出，带回时应当进行______。","28.武器装备科研生产保密资格单位对外发布信息应当进行_____","29.机关、单位日常工作中_____、_____、_____和_____绝密级或较多机密级、秘密级国家秘密的内设机构称为保密要害部门。","30.保密管理要与涉密科研管理同计划、同部署、同检查、同_____、同_____",
                          "26.刑法第一百一十一条规定，为境外的机构、组织、人员窃取、刺探、收买、非法提供国家秘密或者情报的，处_____以上_____以下有期徒刑。","27.涉密岗位和人员的涉密等级分为_____、_____和_____三个等级。","28.国家秘密载体的管理和使用，禁止_____批准，_____、_____国家秘密载体出境。","29.单位应当根据工作需要，严格控制国家秘密的_____。持有国家秘密载体或者知悉国家秘密，应当履行_____。","30.密品应当确定_____，按照国家有关规定做出_____，并在有关技术文件中注明。",
                          "26.密品应当建立_____，做到_____相符。","27.保密要害部门应当实行_____，并采取出入口控制、入侵报警、视频监控等技防措施。","28.非授权人员进入保密要害部门、部位应当履行_____登记，并采取_____措施。","29.未经批准，不得将具有_____功能的设备和具备_____、_____等功能的电子设备带入保密要害部门、部位。",
                          "30.分包涉密项目，应当选择具有_____的单位。",
                          
                          
                          };
        //判断题题目
        String[] panduan ={"8.国家秘密是关系国家安全和利益，依照法定程序确定，在一定时间内只限一定范围的人员知悉的事项。    ( )","9.一切国家机关、武装力量、政党、社会团体、企业事业单位和公民都有保守国家秘密的义务。 （   ）","10.单位可以把知悉国家秘密作为一种行政级别待遇，按照行政级别确定国家秘密知悉范围。 （   ）",
                               "11.国家秘密知悉范围内的机关、单位，其有关工作人员不在知悉范围内，但因工作需要知悉国家秘密的，应当经单位负责人批准。 （   ）","12.国家秘密知悉范围之外的人员，因工作需要确需知悉国家秘密的，应当经本单位负责人同意。 （   ）","13.单位负责人为本单位的定密责任人，对定密工作负总责。 （   ）",
                               "14.单位对所产生的国家秘密事项，应当按照保密事项范围的规定确定密级，同时确定保密期限和知悉范围。 （   ）","15.国家秘密变更后，原定密机关、单位应及时在原国家秘密标志附近重新做出国家秘密标志，并书面通知知悉范围内的机关、单位和人员。 （   ）","16.单位对已定密事项是否属于国家秘密或者属于何种密级有不同意见的，不得向原定密机关、单位提出异议。 （   ）",
                               "17.涉密岗位是指在日常工作中产生、经管或者经常接触、知悉国家秘密事项的岗位。 （   ）","18.涉密人员在非涉密出版物上发表文章、著作，不得涉及国家秘密。 （   ）","19.涉密人员禁止向境外期刊等新闻出版机构投寄稿件。 （   ）","20.涉密人员发表文章、著作凡涉及本单位、本系统业务工作的，应当事先经本单位或上级机关、单位保密审查、审批。  （   ）",
                               "21.涉密载体是指以文字、数据、符号、图形、图像、声音等方式记载国家秘密信息的纸介质、光介质、电磁介质等各类物品。 （   ）","22.制作涉密载体应当在符合保密要求的场所进行。 （   ）","23.涉密载体复制件应当加盖复制机关、单位戳记，并视同原件管理。 （   ）","24.绝密级涉密载体一般不得复制、摘录、引用、汇编，确有工作需要的，必须征得原定密机关、单位或者其上级机关、单位同意。 （   ）",
                               "25.涉密载体可以通过普通邮政、快递等渠道传递。 （   ）",
                               "8.对涉密科研项目文件资料，包括过程文件、电子文档等涉密载体，要进行全面清理、完整归档，个人应根据工作需要自行妥善保管或者销毁。 （   ）","9.阅读和使用涉密载体应当在符合保密要求的办公场所进行。 （   ）","10.绝密级涉密载体应当在符合国家保密标准的设施、设备中保存，并指定专人管理。 （   ）","11.机构撤并时，原机构的涉密载体移交给制发单位时，制发单位不收回的可自行处理。 （   ）",
                               "12.保密要害部门、部位办公场所在采取必要的保密措施后，仍需要对进人的工勤人员严格监督管理。 （   ）","13.专用手机可以随意带人保密要害部门、部位。 （   ）","14.未经批准，不得将带有录音、录像、拍照、信息存储功能的设备带人保密要害部门、部位。 （   ）","15.涉密会议、活动应当按照“谁承办、谁负责”的原则进行管理。 （   ）","16.重要涉密会议、重大涉密活动组织举办者应在必要时，请保密工作机构对保密工作进行监督和指导，并提供必要的安全保密技术服务保障。 （   ）",
                               "17.保密审查主要是对拟公开发布的信息是否涉及国家秘密进行审查，不需要对是否涉及工作秘密、商业秘密、个人隐私等进行甄别鉴定。 （   ）","18.在涉密科研项目结题阶段，要加强成果验收、奖项申报、专利申请等工作的保密管理。 （   ）","19.经严格审批，涉及敏感项目 （如军工技术、军贸等） 的驻外机构和企业可以雇佣外籍人员。 （   ）","20.任何组织和个人不得擅自对外提供国家秘密资料。 （   ）","21.党的纪律处分条例规定，泄露、扩散或者窃取党组织尚未公开事项或者其他应该保密的内容的，情节较重的，给予开除党籍处分。 （   ）",
                               "22.业务工作谁主管，保密工作谁负责”是保密工作的重要原则。 （   ）","23.国家秘密的密级分为绝密、机密、秘密三级。 （   ）","24.绝密级国家秘密是最重要的国家秘密，泄露会使国家安全和利益遭受特别严重的损害。  （   ）","25.机密级国家秘密是重要的国家秘密，泄露会使国家安全和利益遭受严重的损害。 （   ）",
                           "8.秘密级国家秘密是一般的国家秘密，泄露会使国家安全和利益遭受损害。 （   ）","9.保守国家秘密是我国公民的一项基本义务。 （   ）","10.涉密岗位根据涉及国家秘密的程度分为核心、重要和一般三个等级。 （   ）","11.承担涉密项目研究、建设、管理任务的岗位应确定为重要涉密岗位。 （   ）","12.核心涉密岗位是指年产生、处理6件 （项） 绝密级国家秘密事项的工作岗位。 （   ）","13.国防科技工业涉密人员是指取得武器装备科研生产单位保密资格的企业事业单位中，在涉密岗位工作的人员。 （   ）","14.涉密人员应当具有中华人民共和国国籍。 （   ）",
                           "15.涉密人员上岗前要经过保密审查，并接受保密教育培训。 （   ）","16.经审查合格，进人涉密岗位的人员须按照规定签订保密承诺书，明确享有的权利和应当承诺履行的保密义务。 （   ）","17.单位应当定期对涉密人员进行复审，核心涉密人员每年复审一次;重要涉密人员每2 年复审一次，一般涉密人员每3 年复审一次。 （   ）","18.涉密人员在岗期间，保密工作机构应当会同人事部门、涉密人员所在部门有针对性地对其进行保密教育和检查、考核，对严重违反保密规定的应当及时调离涉密岗位。 （   ）",
                           "19.一般涉密人员与境外人员通婚或者接受境外机构、组织及非亲属人员资助的，事后向单位报告即可。 （   ）","20.涉密人员本人或其直系亲属拟申请获得境外永久居留权、长期居留权或外国国籍的应当向单位报告。 （   ）","21.涉密人员离岗后，应当遵守脱密期限规定，核心涉密人员脱密期3 年，重要涉密人员脱密期2 年，一般涉密人员脱密期1年。 （   ）","22.涉密人员脱离涉密岗位3 年内不得在境外驻华机构或者外商独资企业工作。 （   ）","23.涉密人员脱密期内不得在境外驻华机构或者外商独资企业工作，但可以为境外组织或者人员提供劳务咨询或者其他服务。 （   ）","24.涉密人员脱密期内不得在国内中外合资企业工作。 （   ）",
                           "25.涉密人员因私出境应经所在单位同意，还应按照有关规定办理保密审批手续。 （   ）",
                           "8.涉密人员因公出国 （境） 的，应该按照行政隶属关系、干部 （人事） 管理权限和外事管理权限履行审批程序。 （   ）","9.涉密人员脱密期内未经批准可以因私出境。 （   ）","10.涉密人员离开涉密岗位后，就不再对本人在原涉密岗位上知悉的国家秘密事项承担保密义务。 （   ）","11.涉密人员脱密期满后，对所知悉的国家秘密同样承担保密责任和义务。 （   ）","12.出境后可能对国家安全造成危害或者对国家利益造成重大损失的涉密人员，不得批准出境。 （   ）","13.涉密人员出国 （境） 期间受到境外机构、组织和人员的礼品馈赠不须向单位报告。 （  ）","14.涉密单位应当对聘用的保安和临时工进行保密教育培训。 （   ）","15.在私人交往和通信中不得涉及或泄露国家秘密。 （   ）",
                           "16.配偶、子女和本人都是涉密人员，互相谈论涉密事项没有关系。 （   ）","17.各级国家机关、单位对所产生的国家秘密事项，应当按照国家秘密及其密级具体范围的规定及时确定密级。 （   ）","18.定密工作是指对机关、单位业务活动中所产生的国家秘密事项及时、准确确定其密级、保密期限、知悉范围，并对国家秘密载体做出标志，及时通知应当知悉的机关、单位和人员，并按照规定进行全过程管理的活动。 （   ）","19.项目定密是指军工单位对从事的武器装备科研生产项目依法进行确定是否涉密以及是何种密级的工作。 （   ）","20.国家秘密事项范围定得越宽，密级越高，越有利于国家秘密的安全。 （   ）","21.国家秘密的标识为大，大前标密级，★后标保密期限。 （   ）","22.纸介质国家秘密载体，其密级和保密期限应在首页 （或者封面） 标明。 （   ）",
                           "23.涉及国家秘密的地图、图纸、图表在其标题之后或者下方标明密级和保密期限。 （   ）","24.文件、资料汇编中有密件的，应当对各独立密件的密级和保密期限做出国家秘密标志，并在封面或者首页以其中的最低密级和最短保密期限做出国家秘密标志。 （   ）","25.摘录、引用密件中属于国家秘密的内容，应当以其中最高密级和最长保密期限做出国家秘密标志。 （   ）",
                           "8.密件的密级和保密期限变更后，应当在原国家秘密标志位置的附近做出新标志，原标志以明显方式废除。 （   ）","9.在保密期限内解密的密件，应当以能够明显识别的方式标明解密的字样。 （   ）","10.密品应当在壳体及封面、外包装的显著位置标注国家秘密标志，无法在物品本身标注或者不宜做出国家秘密标志的，应当在密品使用维护说明书中注明密级、保密期限和知悉范围，并提出相应的保密措施。 （   ）","11.保密工作机构应当组织相关涉密业务部门研究制定本单位《国家秘密事项范围细目》。 （   ）","12.国家秘密事项的密级和保密期限一经确定，就不能改变。 （   ）","13.国家秘密的保密期限，除有特殊规定外，绝密级事项不超过20 年，机密级事项不超过10 年，秘密级事项不超过5年。 （   ）","14.保密期限需要缩短的，由原确定密级和保密期限的机关、单位或者上级机关决定。 （   ）",
                           "15.保密期限需要延长的，由原确定密级和保密期限的机关、单位或者上级机关决定。 （   ）","16.单位领导要求继续保密的事项，在领导要求的期限内不得解密。 （   ）","17.已解密的事项可以对全社会公开。 （   ）","18.企业的技术成果被确定为国家秘密后，在保密期限内不得擅自解密和对外提供。 （   ）","19.各级机关和涉密单位编发的内部工作简报都应定为国家秘密。 （   ）","20.密级的变更包括降低密级或者提高密级。 （   ）","21.制作国家秘密载体应当依照有关规定标明密级和保密期限，注明发放范围及制作数量，并编排序号。 （   ）","22.纸介质国家秘密载体应当在本机关、本单位内部文印室或者交保密行政管理部门审查批准的单位制作。 （   ）","23.国家秘密载体印制资质单位，使用电子方法排版印制或者打印国家秘密载体的，复制完成后其磁盘内的载体内容可以自行删除。 （   ）",
                           "24.收发国家秘密载体，应当履行清点、登记、编号、签收等手续。 （  ）","25.传递国家秘密载体应当密封包装，装载国家秘密载体的信封或者袋牌上应当标明密级、编号和收发件单位名称。 （   ）",
                           "8.传递国家秘密载体应当通过机要交通、机要通信或者指派专人传递，不得通过普通邮政渠道传递。 （   ）","9.国家秘密文件、资料可以通过普通邮政“特快专递”传送。 （   ）","10.不准通过普通邮政、快递传递属于国家秘密的文件、资料和其他物品。 （   ）","11.记录涉密内容应当使用保密本。 （   ）","12.单位收到绝密级载体后应当按照规定的范围组织阅读和使用，并对接触和知悉绝密级国家秘密的人员做出文字记载。 （   ）","13.单位内部复制国家秘密载体应当履行审批手续，复制机密级以上国家秘密载体须经部门或者单位领导批准，加盖复制戳记，视同原件管理，并进行登记。 （   ）","14.因公出差，且两人同行，可以携带密件到购物、餐饮、娱乐等公共场所。 （   ）","15.阅读、承办、使用密件，应当在符合保密要求的办公场所进行，严禁擅自携带外出。 （   ）",
                           "16.传阅秘密公文的人员很多，逐人逐份登记很麻烦，有时可以不登记，收回时自己在文件登记本上画个勾就可以。 （   ）","17.某协作单位工作人员因工作需要借阅协作范围内的绝密级图纸，该单位接待人员电话请示有关领导同意后，就可以为其办理借阅手续。 （   ）","18.某领导携带涉密U 盘参加行业工作会，会议要求报书面材料，因时间紧急，该领导就使用涉密U 盘连接营业性场所计算机打印机密级汇报资料，打印完成后作删除处理即可。 （   ）","19.某单位进行文件汇编工作时，少量摘抄某涉密文件，经办人员认为该文件汇编册不涉密，可不标注密级。 （   ）","20.涉密人员参加会议带回的秘密文件、资料，应交本单位文秘部门或档案部门登记、管理。 （   ）","21.阅读和使用国家秘密载体应当办理登记、签收手续，管理人员应当随时掌握国家秘密载体的去向。 （   ）",
                           "22.传达国家秘密事项时，凡不准记录、录音、录像的，应当事先申明。 （   ）","23.不准在普通手机通话中涉及国家秘密。 （    ）","24.普通手机处于关机状态下，不存在泄密隐患。 （   ）","25.不得使用普通手机短信传送国家秘密信息。 （   ）",
                           "8.不得使用普通手机中微信、QQ 等社交软件谈论、传递国家秘密。 （   ）","9.不得将普通手机与涉密信息系统连接。 （   ）","10.不得在保密要害部门、部位使用普通手机。 （   ）","11.个人因公外出，携带国家秘密载体应当采取严格的保密措施。 （   ）","12.因工作需要随身携带密件、密品外出时，不得进人购物、餐饮娱乐等公共场所。 （   ）","13.领导干部为了工作方便，可以将密件带回家中处理。 （   ） ","14.工作人员离开办公场所，应当将国家秘密载体存放在保密设备里。 （   ）","15.涉密人员在办公场所阅读、承办、使用密件过程中，需要临时离开，无须将密件存放到保密柜中。 （   ）","16.绝密级秘密载体必须放置在安全可靠的密码保险柜中保存，并有专人管理。 （   ）","17.销毁国家秘密载体，应当采用物理或者化学的方法彻底销毁，确保信息无法还原。 （   ）",
                           "18.在不解密的情况下，机密级、秘密级国家秘密技术成果可以申请公开专利或者由保密专利转为公开专利。 （   ）","19.公开报道、出版或者个人接受境外媒体采访涉及国家政治、经济、外交、科技、军事方面内容的，不用事先经过审批。 （   ）","20.未经批准，严禁公开报道尚属国家秘密的武器装备技术性能指标、科研生产能力、结构布局、产量、发展规划等涉密内容。 （   ）","21.机关、单位每年应当定期对当年所存国家秘密载体进行清查、核对，发现问题的应当及时向保密工作机构报告。  （   ）","22.销毁纸介质国家秘密载体应当采用焚毁、化浆等方法处理，使用碎纸机销毁的应当使用符合保密要求的碎纸机，送造纸厂销毁的应当送保密行政管理部门指定的造纸厂销毁，并由销毁单位两人以上押运、监销。 （   ）","23.U盘上的涉密信息，只要执行删除程序就不可恢复。 （   ）","24.国家秘密载体不得作为废品出售。 （   ）","25.已拆除硬盘的涉密计算机，可以赠送给希望小学使用。 （   ）",
                           "8.密品是指直接含有国家秘密信息，或者通过观察、测试、分析等手段能够获取所承载的国家秘密信息的设备和产品。 （   ）","9.密品的研制、生产、保存和使用单位应当对密品的密级、保密期限、知悉范围、保密要点的内容进行登记，各环节的交接应当登记签收。 （   ）","10.保密要害部门、部位由各机关、单位确定，报国家或者省、自治区、直辖市保密行政管理部门确认或者备案。 （   ）","11.保密要害部门、部位应当具备完善可靠的人防、技防、物防措施。 （   ）","12.涉密场所使用的进口设备和产品应当进行安全技术检测。 （   ）","13.保密要害部门、部位禁止使用无绳电话和普通手机，未经批准不得带人有录音、录像、拍照、信息存储功能的设备。 （   ）","14.普通手机关机后可以带人要害部门、部位。 （   ）","15.涉密电子文档应当标注国家秘密标志，国家秘密标志不能与正文分离。 （   ）","16.不得在涉密计算机和非涉密计算机上交叉使用移动存储介质。 （   ）",
                           "17.不得使用未采取密码保护的通信系统传输涉密信息。 （   ）","18.不得将自己使用的涉密计算机和移动存储介质擅自交给他人使用。 （   ）","19.无线电话不保密，军线电话是保密的。 （   ）","20.数字移动电话传输的是数字信号，因此是保密的。 （   ）","21.在保密通信技术比较落后的情况下，允许在单位内部无保密措施的电话中传递国家秘密。 （   ）","22.电磁信号泄漏泄密的方式主要是辐射和传导两种方式。 （   ）","23.涉密存储介质经文件删除并格式化处理后，仍不得作为非密介质使用。 （   ）","24.利用现代通信及计算机网络远程传输国家秘密信息，必须采用密码保护措施，并禁止密明混用。 （   ）","25.涉密信息使用的加密措施应当经过国家密码主管部门批准，在任何地方都可以使用。 （   ）",
                           "8.涉密信息使用的加密措施须经国家密码主管部门批准，并与所保护的信息密级等级相符合。 （   ）","9.绝密级信息必须加密存储。（   ）","10.涉密计算机不得安装使用无线键盘、无线鼠标、蓝牙、红外设备和无线网卡。 （   ）","11.涉密便携式计算机应当拆除具有无线联网功能的硬件模块。 （   ）","12.无线联网功能硬件模块无法拆除的计算机禁止作为涉密计算机和信息系统的服务器、用户终端使用。 （   ）","13.涉密计算机不得安装来历不明的软件和随意拷贝他人文件。 （   ）","14.涉密计算机和移动存储介质应在保密行政管理部门设立的销毁工作机构或者保密行政管理部门指定的单位销毁。 （   ）","15.在涉密场所使用的与国际互联网或者其他公共网络连接的计算机不得安装视频、音频等输人装置。 （   ）","16.不得在连接国际互联网的计算机上存储和处理涉密信息。 （   ）","17.涉密计算机不得与国际互联网络或者其他公共信息网络相连接。 （   ）",
                           "18.确因工作需要，可以使用私人计算机处理涉密文件，但要与国际互联网断开连接，待处理完涉密信息后可与互联网连接。 （   ）","19.任何单位和个人均不得在国际互联网网络主页、电子公告栏、聊天室、网络新闻组、微博上发布、谈论、张贴、传播国家秘密信息。 （   ）","20.为节约开支，可以将淘汰的涉密计算机交本单位非涉密部门使用。 （   ）","21.涉密信息系统不得直接或者间接连接国际互联网，必须实行物理隔离。 （   ）","22.国家秘密信息不得在与国际互联网连接的计算机和信息系统中存储、处理、传递，但可以在单位内部非涉密单机上存储、处理、传递。 （   ）","23.召开涉及国家秘密的会议，使用无线扩音、通信设备不能把音量开得太大。 （   ）",
                           "24.对参与国家秘密技术研制的科技人员，有关单位不得因其成果不宜公开发表、交流、推广而影响其评奖、表彰和职称的评定。 （   ）","25.在对外经济合作中，凡涉及国家秘密的资料未经保密审查和批准，一律不得对外提供。 （   ）",
                           "8.在对外交往与合作中急需提供国家秘密事项的，可以先提供，后补办手续。 （   ）","9.对外交流中除交流内容与谈判口径外，所提供资料和产品应当经过保密审查。 （   ）","10.对外公开新闻宣传时，单位代号、真实名称、掩护名称不得同时使用。 （   ）","11.接受媒体采访，一般不得涉及国家秘密，特殊情况需要涉及国家秘密的，应当办理审批手续。 （   ）","12.音像制品涉及国家秘密的，应按照涉密资料保管。 （   ）","13.保密教育和保密提醒是科技交流必须坚持的制度。 （   ）","14.对外科技交流活动不得涉及国家秘密，确需涉及国家秘密的应当履行审批手续。 （   ）","15.未经批准，任何单位、部门或者个人均不得到保密要害部门、部位进行采访、照相、录像等活动。 （   ）","16.使国家秘密被不应知悉者知悉的，属于泄露国家秘密行为。 （   ）",
                           "17.发现国家秘密载体在使用中下落不明，应当在8 小时内向本单位保密工作机构报告，向上级报告不应超过24小时。 （   ）","18.国家秘密载体下落不明，自发现之日起，绝密级载体10 日内、机密级、秘密载体60 日内查无结果的，按照泄密事件处理。 （   ）","19.报告泄密事件应当包括被泄露国家秘密的内容、密级、数量及其载体形式、事件发现经过、责任人基本情况、发生的时间、地点及经过。 （   ）","20.将涉及国家秘密的计算机和计算机信息系统与国际互联网连接，泄露国家秘密的，应立为泄密案件。 （   ）","21.过失泄露一项绝密级国家秘密的可不予立案，在单位内部处理。 （   ）","22.违反《中华人民共和国保守国家秘密法》规定，泄露国家秘密，不够刑事处罚的，可以酌情给予行政处分。 （   ）","23.以窃取、刺探、收买的方法，非法获取国家秘密的，都应当依据《刑法》追究其刑事责任。 （   ）","24.发生泄密事件的机关、单位不及时上报或者隐匿不报的，视情节和造成的后果追究有关人员或者领导人的责任。 （   ）",
                           "25.未经相应工作部门批准，不得向境外邮寄密品、密件或者随身携带密品、密件出境。 （   ）",
                           };
        //选择题题目 
        String[] xuanze ={"1.保守国家秘密的工作实行积极防范、突出重点、依法管理的方针， （   ）","2.（   ）主管全国的保密工作。","3.一份文件为秘密级，保密期限是10 年，标志形式应当是(   )。","4.重要涉密部门的人员选配，应当坚持(  )的原则，并定期进行考核，不适合的应及时调整。","5.涉密人员离岗、离职前，应当将所保管和使用的国家秘密载体全部清退，并(   )","6.书面形式的涉密载体，应在封面或者首页做出国家秘密标志，汇编涉密文件、资料或摘录，引用属于国家秘密内容的应按照其中(  )标注。",
                             "7.定密责任人在职权范围内承担有关国家秘密的(   )工作。","1.国家秘密确定的基本程序为:在国家秘密产生的同时，由(  )对照保密事项范围提出定密的具体意见，再由定密责任人审核批准。","2.一般情况下，核心涉密人员脱密期为(  )","3.一般情况下，重要涉密人员脱密期为(  )","4.一般情况下，一般涉密人员脱密期为(  )","5.涉密人员离开原涉密单位，调人其他国家机关和涉密单位的，脱密期管理由(  )负责。","6.下列关于涉密载体管理说法错误的是(  )",
                             "7.复制属于国家秘密的文件、资料或者摘录、引用、汇编属于国家秘密内容形成的国家秘密载体，(  )原件的密级、保密期限和知悉范围。","1.印刷、复印等行业在复制国家秘密载体方面，接受县级以上各级政府(  )的指导和监督。","2.印刷、复印等行业的定点复制单位，在复制国家秘密载体时，应当尽量缩短复制时间，对不能当即取走，确需过夜的，须放在安全可靠的(  )内，并派人值班看守。","3.收发国家秘密载体，应当履行(  )手续。","4.下列关于涉密载体销毁管理错误的是(  )","5.下列不符合保密要害部门、部位人员保密管理要求的是(  )",
                             "6.下列关于保密要害部门、部位的说法错误的是(  )","7.任何情况下，不得向境外传递(  )国家秘密载体。","1.变更密级或者解密，应由(  )","2.传递绝密级秘密载体，(  )","3.领导干部阅办秘密文件、资料和办理其他属于国家秘密的事项，应在(  )内进行。","4.销毁国家秘密载体，应当送(  )设立的销毁工作机构或指定的单位销毁，并由销毁单位派专人押运监销。",
                             "5.汇编涉密文件、资料或摘录、引用属于国家秘密内容的应按照其中(  )密级和(  )保密期限标注国家秘密标志。","6.在境外遇到危及所携带的国家秘密载体安全的紧急情况时，要立即(  )所携带的秘密载体，并及时向本单位的保密部门报告。","7.存储国家秘密信息的介质，应按照所存储信息的(  )密级标明密级，并按照相应的密级文件进行管理。",
                        "1.计算机信息系统的保密管现应实行(  )制，由使用计算机信息系统的单位主管领导负责本单位的计算机信息系统的保密工作，并指定有关机构和人员具体承办。","2.计算机信息系统的安全保密管理人员应经过严格审查，定期进行(  )，并保持相对稳定。","3.各单位应对涉密信息系统的工作人员进行(  )的保密培训，并定期进行保密教育和检查。","4.涉密信息系统打印输出的涉密文件过程稿，应当按照相应(  )文件进行管理。","5.涉密信息系统不得与国际互联网或者其他公共信息网络连接，必须实行(  )","6.存储国家秘密信息的U 盘只能在(  )计算机上使用。","7.存储过国家秘密的涉密存储介质不能(     )密级使用。","1.涉密信息处理场所应当定期或者根据需要进行(  )检查。","2.绝密级国家秘密技术在保密期限内(  )申请专利或者保密专利。","3.参加涉外活动一般不得携带涉密载体，确需携带机密级、秘密级涉密载体的，要经(  )批准。",
                        "4.下列关于参加涉密会议、活动人员保密管理要求说法错误的是(  )","5.下列关于涉密会议、活动宣传报道保密管理要求说法错误的是(  )","6.下列关于涉密视频会议的保密管理要求说法正确的是(  )","7.下列关于涉外活动保密管理要求说法错误的是(  )","1.违反《中华人民共和国保守国家秘密法》的规定，(  )泄露国家秘密，情节严重的，依照刑法有关规定追究刑事责任。","2.某领导外出时提包被窃，找回后发现包内钱物丢失，涉密文件完整无缺。这一事件(  )","3.属于国家秘密的文件、资料或者其他物品下落不明的，自发现之日起，绝密级(  )内，机密、秘密级(  )内查无下落的，应当按照泄密事件处理。","4.泄密事件查处工作的终结期限为(  )","5.发生泄密事件的机关、单位，应当在发现后的(  )小时内，书面向有关保密行政管理部门报告。","6.向境外组织、机构人员泄露绝密级国家秘密的泄密案件，由(  )组织或者参与查处。",
                        "7.过失泄露绝密级(  )件、机密级(  )件或者秘密级(  )件的，应予立案。","1.对在定密工作中因玩忽职守、不负责任错定、漏定，致使国家秘密泄露，或者妨碍正常交流，使国家利益造成损失的，应视情节的轻重追究当事人的(  )","2.刑法第一百一十一条规定，为境外的机构、组织、人员窃取、刺探、收买、非法提供国家秘密或者情报的，处(  )","3.刑法第三百九十八条规定，国家机关工作人员违反保守国家秘密法的规定，故意或者过失泄露国家秘密，情节特别严重的，处(  )","4.涉嫌故意泄露(  )以上的，应以故意泄露国家秘密罪立案。","5.确定国家秘密事项的密级依据是（  ）","6.涉密人员的涉密等级如何划分（  ）","7.核心沙密人员的脱密期为（  ）",
                        "1.张某被界定为重要沙密人员，2006年3月5日因故被单位解聘，他的脱密期最早于（  ）截止。","2.一份机密级文件保密期限是20 年，密级标识应标注为（  ）","3.机密级国家秘密事项保密期限是（  ）","4.复制国家秘密载体或者摘录属于国家秘密的内容的保密管理要求是（  ）","5.秘密级国家秘密载体应当存放在（  ）中。","6.涉密计算机中的涉密电子文档，都应当标明密级标识，下面正确的是（  ）","7.符合国家保密要求的涉密计算机屏幕保护程序等待时间应当（  ）","1.秘密级计算机，身份鉴别口令的更新周期为（  ） ","2.当需要将病毒库、系统补丁程序等导入涉密信息系统时，可以采取下列哪种方式（  ）","3.某单位新购置一批带有无线互联功能的笔记本电脑，准备作为涉密便携式计算机使用，下列做法正确的是（  ）","4.根据工作需要，配备专供外出携带的涉密计算机和存储介质，对于每次归还的设备和介质应（  ）","5.使用便携式计算机，下列做法错误的是（  ）","6.对处理国家秘密的办公自动化设备管理要求是（  ）","7.涉密场所通信设备的使用要求是（  ）",};

        


        //选择判断的答案
      

        //选择题的选项
        String[,] xzxx1 = { { "A.确保国家秘密安全", "B.便利各项工作的开展", "C.既确保国家秘密安全，又便利信息资源合理利用", "D.实事求是" }, { "A.国家安全部门", "B.公安部门", "C.中央保密委员会", "D.国家保密行政管理部门" }, { "A.秘密10年", "B.秘密★", "C.秘密★10年", "D.秘密●10年" }, 
                          { "A.谁选配谁负责", "B.先审后用", "C.先选后训", "D.边审边用" }, { "A.登记销毁", "B.订卷归档", "C.办理移交手续", "D.不一定办理移交手续" }, { "A.最高密级和最长保密期限", "B.最高密级和最短保密期限", "C.最低密级和最长保密期限", "D.最低密级和最短保密期限" }, { "A.确定", "B.变更", "C.解除", "D.以上都正确" } };
        String[,] xzxx2 = { { "A.单位领导", "B.定密责任人", "C.承办人", "D.上级机关" }, { "A.3年", "B.2年", "C.1年", "D.不超过6个月" }, { "A.3年", "B.2年", "C.1年", "D.不超过6 个月" }, { "A.3年", "B.2年", "C.1年", "D.不超过6个月时" },
                         { "A.原涉密单位", "B.调入单位上级管理部门", "C.原单位上级管理部门", "D.调入单位" }, { "A.将涉密载体保存在安全保密的场所和部位，并配备必要的保密设施、设备", "B.定期清查、核对", "C.离开办公场所，将涉密载体存放在保密设备中", "D.涉密载体丢失后经查找回的无须报告" }, { "A.不得擅自改变", "B.可以根据情况改变", "C.应降低", "D.应提高" }};
        String[,] xzxx3 = { { "A.公安部门", "B.工商部门", "C.保密行政管理部门", "D.国防科技管理部门" }, { "A.车间", "B.仓库", "C.文件柜", "D.办公室" }, { "A.清点、登记、编号、签收等", "B.交接", "C.签字", "D.移交" }, 
                          { "A.自行销毁少量涉密载体的应当使用符合国家保密标准的销毁设备和方法", "B.涉密载体销毁的登记、审批记录无须长期保存", "C.机关、单位送销涉密载体应当分类封装、安全运送，并派专人现场监销", "D.销毁涉密载体应当履行清点、登记、审批手续，并送交保密行政管理部门设立的销毁工作机构或指定的单位销毁" }, { "A.上岗前保密审查", "B.定期进行在岗保密教育培训", "C.未经批准私自出国", "D.签订保密承诺书" },
                          { "A.需按国家保密标准配备技术防护设备", "B.应使用经过保密技术检测的设备和产品", "C.在不谈论国家秘密的情况下可使用普通手机", "D.经机关、单位保密委员会批准，并登记备案，可以将专用手机带入保密要害部位" }, { "A.机密级", "B.秘密级", "C.绝密级", "D.内部" } };
        String[,] xzxx4 = { { "A.密件使用单位决定", "B.原定密机关、单位决定，也可以由其上级机关决定", "C.国家保密行政管理部门指定的单位决定", "D.定密责任人直接确定" }, { "A.只能通过机要交通递送", "B.只能通过机要通信递送", "C.必须通过机要交通、机要通信或者派人直接递送", "D.只能通过可靠快递" }, { "A.办公场所", "B.家中或办公场所", "C.咖啡馆", "D.图书馆" },
                          { "A.公安部门", "B.上级机关", "C.保密行政管理部门", "D.造纸厂" }, { "A.最高  最长", "B.最高  最短", "C.最低  最长", "D.最低  最短" }, { "A.销毁", "B.藏匿", "C.邮寄", "D.上缴" }, { "A.最高", "B.最低", "C.相应", "D.不同" } };
        String[,] xzxx5 = { { "D.不同", "B.单位负责", "C.领导责任", "D.个人责任" }, { "A.考评", "B.考试", "C.考核", "D.测评" }, { "A.工作中", "B.定期", "C.上岗前", "D.一定" }, { "A.普通", "B.一般", "C.密级", "D.内部" }, { "A.防火墙隔离", "B.物理隔离", "C.逻辑隔离", "D.外部隔离" }, { "A.本单位同一密级或者更高密级的涉密", "B.办公用", "C.上网用", "D.涉密" }, { "A.提高", "B.调整", "C.解除", "D.更改" } };
        String[,] xzxx6 = { { "A.安全性能", "B.保密技术", "C.不定期", "D.环境" }, { "A.可以", "B.不得", "C.暂缓", "D.根据情况" }, { "A.上级机关", "B.保密工作机构", "C.机关、单位负责人", "D.保密行政管理部门" }, { "A.可自行委托其他人员代替参加涉密会议、活动", "B.不得擅自记录、录音、摄像", "C.不得使用无线键盘、无线网卡等设备或装置", "D.不得将手机带入" }, { "A.撰写新闻稿件，不得涉及国家秘密", "B.会议有新闻通稿或报道口径的，应按照新闻通稿或报道口径报道", "C.经会议、活动组织者审批后，可公开报道和播放稿件、录像、图片等", "D.有关业务主管部门无须审查公开报道内容" },
                          { "A.会议音频视频资料按照涉密载体管理", "B.无须指定专人负责视频会议系统运行维护和音视频录制", "C.会议召开时，无须对会场及设施设备进行安全保密检查", "D.无须按照涉密网络有关要求建设和管理视频会议系统" }, { "A.不得带领国(境) 外人员进入涉密场所", "B.与国(境) 外人员会谈不得涉及国家秘密", "C.不得利用国(境) 外人员办公设备处理涉密信息", "D.在紧急情况下，可以利用国(境) 外通信设施进行涉密通信联络" } };
        String[,] xzxx7 = { { "A.故意", "B.故意或者过失", "C.过失", "D.擅自" }, { "A.属于泄密事件", "B.不应视为泄密事件", "C.在不能证明文件未被不应知悉者知悉时，按照泄密事件处理", "D.无法定性" }, { "A.10日，60日", "B.15日，60日", "C.10日，30日", "D.15日，30日" }, { "A.6个月", "B.1个月", "C.3个月", "D.2个月" }, 
                          { "A.60", "B.48", "C.24", "D.12" }, { "A.省、自治区、直辖市保密行政管理部门", "B.国家保密行政管理部门", "C.中央国家机关保密部门", "D.国防科技工业管理部门" }, { "A.1,2,3", "B.1,3,3", "C.1,3,4", "D.3,2,1" } };
        String[,] xzxx8 = { { "A.行政责任", "B.刑事责任", "C.法纪责任", "D.违规责任" }, { "A.十年以上有期徒刑或无期徒刑", "B.五年以上十年以下有期徒刑", "C.三年以上七年以下有期徒刑", "D.三年以下有期徒刑" }, { "A.十年以上有期徒刑或无期徒刑", "B.五年以上十年以下有期徒刑", "C.三年以上七年以下有期徒刑", "D.三年以下有期徒刑" }, { "A.秘密级国家秘密1项(件)", "B.机密级国家秘密1项(件)", "C.机密级国家秘密2项(件)", "D.秘密级国家秘密2项(件)" }, 
                          { "A.国家秘密及其密级具体范围", "B.按照型号产品重要程度确定", "C.承办人根据经验自行确定", "D.定密责任人确定" }, { "A.绝密  秘密  机密  ", "B.核心 重要  一般 ", "C.重要 一般 内部", "D.特殊 重点 普通" }, { "A.2年", "B.3年", "C.按照工龄折算", "D.5年" } };
        String[,] xzxx9 = { { "A.2006年9月5日", "B.2007年3月5日", "C.2008年3月5日", "D.2009年3月6日" }, { "A.机密20年", "B.机密★", "C.机密★20年", "D.机密20年★" }, { "A.一般不超过10年", "B.一般不超过15年", "C.一般不超过30年", "D.一般不超过20年" },
                          { "A.按照原件的密级、保密期限和知悉范围管理", "B.可以在收文本上重新登记、编号即可", "C.可以视情况加盖复印章", "D.可以作解密处理" }, { "A.密码文件柜", "B.铁皮柜", "C.带锁书柜", "D.一般木柜" },
                          { "A.应当标注在电子文档的首页", "B.应当标注在电子文档的首页的左上角", "C.可以建立一个标明密级标识的文件夹，将涉密电子文档都存放在涉密文件夹中，就不需要对每一个涉密电子文档逐个标明密级", "D.标注在电子文档的首页的密级标识应当采用三号仿宋字体" }, { "A.不超过一分钟", "B.不超过三分钟", "C.不超过五分钟", "D.不超过十分钟" } };
        String[,] xzxx10 = { { "A.3天", "B.7天", "C.30天", "D.60天" }, { "A.通过中间机刻录只读光盘", "B.通过中间机拷贝普通U盘", "C.通过中间机使用带有读写锁定开关的专用U盘，并且确保在涉密信息系统内使用时U盘处于只读状态", "D.使用MP3播放器作为存储介质进行导入" }, { "A.将便携式计算机确定涉密等级并粘贴密级标识后，作为涉密计算机使用", "B.在操作系统的“设备管理器中”将无线网卡禁用", "C.从便携式计算机的BIOS设置中关闭无线网卡功能", "D.拆除具有无线互联功能的硬件模块" },
                           { "A.进行保密技术检查", "B.删除涉密文件后，放入保密柜保存", "C.转交给其他涉密人员，继续携带外出使用", "D.及时销毁" }, { "A.非涉密便携式计算机不得存储或者处理涉密信息", "B.涉密便携式携带外出应当履行程序，带出前后应进行检查", "C.非涉密便携式计算机可以短暂存储涉密信息，使用完毕后立即删除", "D.涉密便携式计算机应物理拆除无线联网模块" }, { "A.禁止接入国际互联网", "B.可以接入公共信息网", "C.可以接入内部非涉密信息系统", "D.可以与普通电话线连接使用" }, 
                           { "A.禁止使用无线通信设备", "B.可以使用无绳电话", "C.可以用手机连接互联网", "D.可以使用具有无线互联功能的设备" } };
        String[,] xzxx11 = new String[70, 4];

        String[,] sjxzxx = new String[7, 4];//随机题的选项
        String[,] tem1=new String[11,25];
      //填空的答案
        String[,] dxdaan ={{"安全","利益","一定范围","","积极防范","突出重点","依法管理","","党管保密","依法管理","","","2010","","","","中央保密委员会","","",""},
                          {"国家保密行政管理部门","","","","绝密","","","","国家秘密","密级具体范围","","","确定","变更","解除","","最高密级","最长保密期限","",""},
                          {"基本义务","","","","国家秘密","","","","保密审查","培训","","","3","2","1","","5","","",""},
                          {"保密承诺书","","","","原确定密级","保密期限","","","国家秘密","","","","处理","传递","","","文件","资料","其他物品",""},
                          {"国家秘密载体","","","","物理","化学","","","交叉","","","","不得","","","","物理隔离","","","",},
                          {"处理","最高密级","","","涉密计算机","","","","涉密信息","","","","信息化","","","","旁站","","","",},
                          {"标明密级","","","","一周","","","","一次性","生理特征","","","十分钟","","","","禁止","低密级","","",},
                          {"审批手续","","","","保密检查","","","","保密审查和审批","","","","产生","传递","使用","管理","总结","奖惩","","",},
                          {"五年","十年","","","核心","重要","一般","","未经有关主管部门","携带","传递","","知悉范围","审批程序","","","密级","国家秘密标志","",""},
                          {"台账","账物","","","区域隔离","","","","审批程序","监督管理","","","无线通信","拍摄","录音","","相应保密资格","","",""},
                          {"","","","","","","","","","","","","","","","","","","",""}
                          };

        int[,] daan ={{3,4,3,2,3,1,4,1,1,2,1,2,1,1,1,2,1,1,2,1,1,1,1,1,2},{3,1,2,3,4,4,1,2,1,1,2,1,2,1,2,1,2,1,1,1,2,1,1,1,1}
                  ,{3,3,1,2,3,3,3,1,1,1,2,2,1,1,1,1,2,1,2,1,1,2,2,2,1},{2,3,1,3,1,1,1,1,2,2,1,1,2,1,1,2,1,1,1,2,1,1,1,2,1},
                      {3,3,3,3,2,1,3,1,1,1,2,2,2,1,1,2,2,1,2,1,1,1,2,1,1},{2,2,3,1,4,1,4,1,2,1,1,1,1,2,1,2,2,2,2,1,1,1,1,2,1},
                      {2,3,1,3,3,2,3,1,1,1,1,1,2,1,2,1,1,2,2,1,1,1,2,1,2},{  1,2,3,3,1,2,2,1,1,1,1,1,1,2,1,1,1,1,2,2,2,1,1,1,2},
                      { 3,3,4,1,1,1,4,1,1,1,1,1,1,1,1,1,1,2,1,2,1,2,2,1,1},{ 3,1,4,1,3,1,1,2,2,1,1,1,1,1,1,1,1,1,1,1,2,1,1,1,1},
                      { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 }
                     
                     };

        //正确的选择题
        int[] zqsjdaan = {3,4,3,2,3,1,4,3,1,2,3,4,4,1,3,3,1,2,3,3,3,2,3,1,3,1,1,1,3,3,3,3,2,1,3,2,2,3,1,4,1,4,2,3,1,3,3,2,3,1,2,3,3,1,2,2,3,3,4,1,1,1,4,3,1,4,1,3,1,1 };
        int[] zqpddaan ={1,1,2,1,2,1,1,1,2,1,1,2,1,1,1,1,1,2,2,1,1,2,1,2,1,2,1,2,1,1,1,2,1,1,1,1,1,1,1,2,2,1,1,1,1,2,1,2,1,1,2,2,2,1,1,2,2,1,1,2,1,1,2,1,1,1,2,1,1,1,2,1,
                       1,1,1,2,2,2,1,1,2,2,1,2,1,1,1,2,1,1,1,2,1,1,1,1,2,1,2,2,2,2,1,1,1,1,2,1,1,1,1,1,1,2,1,2,1,1,2,2,1,1,1,2,1,2,1,1,1,1,1,1,2,1,1,1,1,2,2,2,1,1,1,2,
                       1,1,1,1,1,1,1,1,1,1,2,1,2,1,2,2,1,1,2,2,1,1,1,1,1,1,1,1,1,1,1,2,1,1,1,1};
        int[] myzqdaan = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 };
         int flag11=Properties.Settings.Default.numtitle-1;

         int[] sjxzt = UseHashTableToNonRepeatedRandom(7,0,70);//随机选择题
         int[] sjpdt = UseHashTableToNonRepeatedRandom(18, 0, 180);//随机判断题
         int[] sjtkt = UseHashTableToNonRepeatedRandom(5, 1, 50);//随机填空题
        //填空题的空白数
         int[] tkasd = { 0, 0, 0, 0, 0 };
         int[] tkhx = { 3, 3, 2, 1, 1, 1, 1, 2, 3, 2, 1, 1, 2, 3, 1, 1, 2, 1, 2, 3, 1, 2, 1, 1, 1, 2, 1, 1, 1, 1, 1, 1, 2, 1, 2, 1, 1, 1, 4, 2, 2, 3, 3, 2, 2, 2, 1, 2, 3, 1 };
        String[] timu = new String[30];
        String[,] sjdxzq ={{"安全","利益","一定范围",""},{"积极防范","突出重点","依法管理",""},{"党管保密","依法管理","",""},{"2010","","",""},{"中央保密委员会","","",""},{"国家保密行政管理部门","","",""},{"绝密","","",""},{"国家秘密","密级具体范围","",""},{"确定","变更","解除",""},{"最高密级","最长保密期限","",""},
                          {"基本义务","","",""},{"国家秘密","","",""},{"保密审查","培训","",""},{"3","2","1",""},{"5","","",""},{"保密承诺书","","",""},{"原确定密级","保密期限","",""},{"国家秘密","","",""},{"处理","传递","",""},{"文件","资料","其他物品",""},
                          { "国家秘密载体","","",""},{"物理","化学","",""},{"交叉","","",""},{"不得","","",""},{"物理隔离","","",""},{"处理","最高密级","",""},{"涉密计算机","","",""},{"涉密信息","","",""},{"信息化","","",""},{"旁站","","",""},
                          { "标明密级","","",""},{"一周","","",""},{"一次性","生理特征","",""},{"十分钟","","",""},{"禁止","低密级","",""},{"审批手续","","",""},{"保密检查","","",""},{"保密审查和审批","","",""},{"产生","传递","使用","管理"},{"总结","奖惩","",""},
                          {"五年","十年","",""},{"核心","重要","一般",""},{"未经有关主管部门","携带","传递",""},{"知悉范围","审批程序","",""},{"密级","国家秘密标志","",""},{"台账","账物","",""},{"区域隔离","","",""},{"审批程序","监督管理","",""},{"无线通信","拍摄","录音",""},{"相应保密资格","","",""}};
        void fuzhixz()//给选择题的选项
        {
            for (int i = 0; i < 7; i++)
            {
                xzxx11[i, 0] = xzxx1[i, 0];
                xzxx11[i, 1] = xzxx1[i, 1];
                xzxx11[i, 2] = xzxx1[i, 2];
                xzxx11[i, 3] = xzxx1[i, 3];
            }
            for (int i = 7; i < 14; i++)
            {
                xzxx11[i, 0] = xzxx2[i-7, 0];
                xzxx11[i, 1] = xzxx2[i-7, 1];
                xzxx11[i, 2] = xzxx2[i-7, 2];
                xzxx11[i, 3] = xzxx2[i-7, 3];
            }
            for (int i = 14; i < 21; i++)
            {
                xzxx11[i, 0] = xzxx3[i-14, 0];
                xzxx11[i, 1] = xzxx3[i-14, 1];
                xzxx11[i, 2] = xzxx3[i-14, 2];
                xzxx11[i, 3] = xzxx3[i-14, 3];
            }
            for (int i = 21; i < 28; i++)
            {
                xzxx11[i, 0] = xzxx4[i-21, 0];
                xzxx11[i, 1] = xzxx4[i-21, 1];
                xzxx11[i, 2] = xzxx4[i-21, 2];
                xzxx11[i, 3] = xzxx4[i-21, 3];
            }
            for (int i = 28; i < 35; i++)
            {
                xzxx11[i, 0] = xzxx5[i-28, 0];
                xzxx11[i, 1] = xzxx5[i-28, 1];
                xzxx11[i, 2] = xzxx5[i-28, 2];
                xzxx11[i, 3] = xzxx5[i-28, 3];
            }
            for (int i = 35; i < 42; i++)
            {
                xzxx11[i, 0] = xzxx6[i-35, 0];
                xzxx11[i, 1] = xzxx6[i-35, 1];
                xzxx11[i, 2] = xzxx6[i-35, 2];
                xzxx11[i, 3] = xzxx6[i-35, 3];
            }
            for (int i = 42; i <49; i++)
            {
                xzxx11[i, 0] = xzxx7[i-42, 0];
                xzxx11[i, 1] = xzxx7[i-42, 1];
                xzxx11[i, 2] = xzxx7[i-42, 2];
                xzxx11[i, 3] = xzxx7[i-42, 3];
            }
            for (int i = 49; i < 56; i++)
            {
                xzxx11[i, 0] = xzxx8[i-49, 0];
                xzxx11[i, 1] = xzxx8[i-49, 1];
                xzxx11[i, 2] = xzxx8[i-49, 2];
                xzxx11[i, 3] = xzxx8[i-49, 3];
            }
            for (int i = 56; i < 63; i++)
            {
                xzxx11[i, 0] = xzxx9[i-56, 0];
                xzxx11[i, 1] = xzxx9[i-56, 1];
                xzxx11[i, 2] = xzxx9[i-56, 2];
                xzxx11[i, 3] = xzxx9[i-56, 3];
            }
            for (int i = 63; i < 70; i++)
            {
                xzxx11[i, 0] = xzxx10[i-63, 0];
                xzxx11[i, 1] = xzxx10[i-63, 1];
                xzxx11[i, 2] = xzxx10[i-63, 2];
                xzxx11[i, 3] = xzxx10[i-63, 3];
            }


        }

        void selecttimu()  {
             if (Properties.Settings.Default.numtitle == 11)//随机
            {
                panel33.Visible = true;


                for (int i = 0; i < 7; i++)
                {
                    if (sjxzt[i] < 7)
                    { timu[i] =(i+1).ToString()+ "  1-"+xuanze[sjxzt[i]]; }
                    else if(sjxzt[i]<14)
                        timu[i] = (i + 1).ToString() + " 2-" + xuanze[sjxzt[i]];
                    else if ( sjxzt[i] < 21)
                        timu[i] = (i + 1).ToString() + " 3-" + xuanze[sjxzt[i]];
                    else if ( sjxzt[i] < 28)
                        timu[i] = (i + 1).ToString() + " 4-" + xuanze[sjxzt[i]];
                    else if (sjxzt[i] < 35)
                        timu[i] = (i + 1).ToString() + " 5-" + xuanze[sjxzt[i]];
                    else if ( sjxzt[i] < 42)
                        timu[i] = (i + 1).ToString() + " 6-" + xuanze[sjxzt[i]];
                    else if (sjxzt[i] < 49)
                        timu[i] = (i + 1).ToString() + " 7-" + xuanze[sjxzt[i]];
                    else if ( sjxzt[i] < 56)
                        timu[i] = (i + 1).ToString() + " 8-" + xuanze[sjxzt[i]];
                    else if (sjxzt[i] < 63)
                        timu[i] = (i + 1).ToString() + " 9-" + xuanze[sjxzt[i]];
                    else if( sjxzt[i] < 70)
                        timu[i] = (i + 1).ToString() + " 10-" + xuanze[sjxzt[i]];


                    //找出随机题的选项
                    sjxzxx[i, 0] = xzxx11[sjxzt[i], 0];
                    sjxzxx[i, 1] = xzxx11[sjxzt[i], 1];
                    sjxzxx[i, 2] = xzxx11[sjxzt[i], 2];
                    sjxzxx[i, 3] = xzxx11[sjxzt[i], 3];
                    daan[10,i] = zqsjdaan[sjxzt[i]];
                }
                tem1 = sjxzxx;
                for (int i = 0; i < 18; i++)
                {
                    if (sjpdt[i] < 18)
                    { timu[i+7] = (i+8).ToString() + " 1-" + panduan[sjpdt[i]]; }
                    else if (sjpdt[i] < 36)
                        timu[i + 7] = (i + 8).ToString() + " 2-" + panduan[sjpdt[i]];
                    else if (sjpdt[i] < 54)
                        timu[i + 7] = (i + 8).ToString() + " 3-" + panduan[sjpdt[i]];
                    else if (sjpdt[i] < 72)
                        timu[i + 7] = (i + 8).ToString() + " 4-" + panduan[sjpdt[i]];
                    else if (sjpdt[i] < 90)
                        timu[i + 7] = (i + 8).ToString() + " 5-" + panduan[sjpdt[i]];
                    else if (sjpdt[i] < 108)
                        timu[i + 7] = (i + 8).ToString() + " 6-" + panduan[sjpdt[i]];
                    else if (sjpdt[i] < 126)
                        timu[i + 7] = (i + 8).ToString() + " 7-" + panduan[sjpdt[i]];
                    else if (sjpdt[i] < 144)
                        timu[i + 7] = (i + 8).ToString() + " 8-" + panduan[sjpdt[i]];
                    else if (sjpdt[i] < 162)
                        timu[i + 7] = (i + 8).ToString() + " 9-" + panduan[sjpdt[i]];
                    else if (sjpdt[i] < 180)
                        timu[i + 7] = (i + 8).ToString() + " 10-" + panduan[sjpdt[i]];


                  //  timu[i + 7] = panduan[sjpdt[i]];
                    daan[10,i+7] = zqpddaan[sjpdt[i]];
                }
                for (int i = 0; i < 5; i++)
                {
                    if (sjtkt[i]<5)
                        timu[i + 25] =(i+26).ToString()+" 1 "+ tiankong[sjtkt[i]];
                    else if (sjtkt[i] < 10)
                        timu[i + 25] = (i + 26).ToString() + " 2-" + tiankong[sjtkt[i]];
                    else if (sjtkt[i] < 15)
                        timu[i + 25] = (i + 26).ToString() + " 3-" + tiankong[sjtkt[i]];
                    else if (sjtkt[i] < 20)
                        timu[i + 25] = (i + 26).ToString() + " 4-" + tiankong[sjtkt[i]];
                    else if (sjtkt[i] < 25)
                        timu[i + 25] = (i + 26).ToString() + " 5-" + tiankong[sjtkt[i]];
                    else if (sjtkt[i] < 30)
                        timu[i + 25] = (i + 26).ToString() + " 6-" + tiankong[sjtkt[i]];
                    else if (sjtkt[i] < 35)
                        timu[i + 25] = (i + 26).ToString() + " 7-" + tiankong[sjtkt[i]];
                    else if (sjtkt[i] < 40)
                        timu[i + 25] = (i + 26).ToString() + " 8-" + tiankong[sjtkt[i]];
                    else if (sjtkt[i] < 45)
                        timu[i + 25] = (i + 26).ToString() + " 9-" + tiankong[sjtkt[i]];
                    else if (sjtkt[i] < 50)
                        timu[i + 25] = (i + 26).ToString() + " 10-" + tiankong[sjtkt[i]];







                    tkasd[i] = tkhx[sjtkt[i]];
                }
                 dxdaan[10, 0] = sjdxzq[sjtkt[0],0];
                 dxdaan[10, 1] = sjdxzq[sjtkt[0], 1];
                 dxdaan[10, 2] = sjdxzq[sjtkt[0], 2];
                 dxdaan[10, 3] = sjdxzq[sjtkt[0], 3];

                 dxdaan[10, 4] = sjdxzq[sjtkt[1], 0];
                 dxdaan[10, 5] = sjdxzq[sjtkt[1], 1];
                 dxdaan[10, 6] = sjdxzq[sjtkt[1], 2];
                 dxdaan[10, 7] = sjdxzq[sjtkt[1], 3];

                 dxdaan[10, 8] = sjdxzq[sjtkt[2], 0];
                 dxdaan[10, 9] = sjdxzq[sjtkt[2], 1];
                 dxdaan[10, 10] = sjdxzq[sjtkt[2], 2];
                 dxdaan[10, 11] = sjdxzq[sjtkt[2], 3];

                 dxdaan[10, 12] = sjdxzq[sjtkt[3], 0];
                 dxdaan[10, 13] = sjdxzq[sjtkt[3], 1];
                 dxdaan[10, 14] = sjdxzq[sjtkt[3], 2];
                 dxdaan[10, 15] = sjdxzq[sjtkt[3], 3];

                 dxdaan[10, 16] = sjdxzq[sjtkt[4], 0];
                 dxdaan[10, 17] = sjdxzq[sjtkt[4], 1];
                 dxdaan[10, 18] = sjdxzq[sjtkt[4], 2];
                 dxdaan[10, 19] = sjdxzq[sjtkt[4], 3];

                label_timu.Text = timu[0];

                c1.Text = sjxzxx[0, 0];
                c2.Text = sjxzxx[0, 1];
                c3.Text = sjxzxx[0, 2];
                c4.Text = sjxzxx[0, 3];
                labeltitle.Text = "随机测试";
            }
            if (Properties.Settings.Default.numtitle == 1)
            {
                for (int i = 0; i < 7; i++)
                {
                    timu[i] = xuanze[i];
                }
                for (int i = 0; i < 18; i++)
                {
                    timu[i + 7] = panduan[i];
                }
                for (int i = 0; i < 5; i++)
                {
                    timu[i + 25] = tiankong[i];
                }
                label_timu.Text = timu[0];
                tem1 = xzxx1;

                c1.Text = tem1[0, 0];
                c2.Text = tem1[0, 1];
                c3.Text = tem1[0, 2];
                c4.Text = tem1[0, 3];
                labeltitle.Text = "第一套";
            }
            if (Properties.Settings.Default.numtitle == 2)
            {
                for (int i = 0; i < 7; i++)
                {
                    timu[i] = xuanze[i+7];
                }
                for (int i = 0; i < 18; i++)
                {
                    timu[i + 7] = panduan[i+18];
                }
                for (int i = 0; i < 5; i++)
                {
                    timu[i + 25] = tiankong[i+5];
                }
                label_timu.Text = timu[0];
                tem1 = xzxx2;

                c1.Text = tem1[0, 0];
                c2.Text = tem1[0, 1];
                c3.Text = tem1[0, 2];
                c4.Text = tem1[0, 3];
                labeltitle.Text = "第二套";
            }
            if (Properties.Settings.Default.numtitle == 3)
            {
                for (int i = 0; i < 7; i++)
                {
                    timu[i] = xuanze[i + 14];
                }
                for (int i = 0; i < 18; i++)
                {
                    timu[i + 7] = panduan[i + 36];
                }
                for (int i = 0; i < 5; i++)
                {
                    timu[i + 25] = tiankong[i + 10];
                }
                label_timu.Text = timu[0];
                tem1 = xzxx3;

                c1.Text = tem1[0, 0];
                c2.Text = tem1[0, 1];
                c3.Text = tem1[0, 2];
                c4.Text = tem1[0, 3];
                labeltitle.Text = "第三套";
            }
            if (Properties.Settings.Default.numtitle == 4)
            {
                for (int i = 0; i < 7; i++)
                {
                    timu[i] = xuanze[i + 21];
                }
                for (int i = 0; i < 18; i++)
                {
                    timu[i + 7] = panduan[i + 54];
                }
                for (int i = 0; i < 5; i++)
                {
                    timu[i + 25] = tiankong[i + 15];
                }
                label_timu.Text = timu[0];
                tem1 = xzxx4;

                c1.Text = tem1[0, 0];
                c2.Text = tem1[0, 1];
                c3.Text = tem1[0, 2];
                c4.Text = tem1[0, 3];
                labeltitle.Text = "第四套";
            }
            if (Properties.Settings.Default.numtitle == 5)
            {
                for (int i = 0; i < 7; i++)
                {
                    timu[i] = xuanze[i + 28];
                }
                for (int i = 0; i < 18; i++)
                {
                    timu[i + 7] = panduan[i + 72];
                }
                for (int i = 0; i < 5; i++)
                {
                    timu[i + 25] = tiankong[i + 20];
                }
                label_timu.Text = timu[0];
                tem1 = xzxx5;

                c1.Text = tem1[0, 0];
                c2.Text = tem1[0, 1];
                c3.Text = tem1[0, 2];
                c4.Text = tem1[0, 3];
                labeltitle.Text = "第五套";
            }
            if (Properties.Settings.Default.numtitle == 6)
            {
                for (int i = 0; i < 7; i++)
                {
                    timu[i] = xuanze[i + 35];
                }
                for (int i = 0; i < 18; i++)
                {
                    timu[i + 7] = panduan[i + 90];
                }
                for (int i = 0; i < 5; i++)
                {
                    timu[i + 25] = tiankong[i + 25];
                }
                label_timu.Text = timu[0];
                tem1 = xzxx6;

                c1.Text = tem1[0, 0];
                c2.Text = tem1[0, 1];
                c3.Text = tem1[0, 2];
                c4.Text = tem1[0, 3];
                labeltitle.Text = "第六套";
            }
            if (Properties.Settings.Default.numtitle == 7)
            {
                for (int i = 0; i < 7; i++)
                {
                    timu[i] = xuanze[i + 42];
                }
                for (int i = 0; i < 18; i++)
                {
                    timu[i + 7] = panduan[i + 108];
                }
                for (int i = 0; i < 5; i++)
                {
                    timu[i + 25] = tiankong[i + 30];
                }
                label_timu.Text = timu[0];
                tem1 = xzxx7;

                c1.Text = tem1[0, 0];
                c2.Text = tem1[0, 1];
                c3.Text = tem1[0, 2];
                c4.Text = tem1[0, 3];
                labeltitle.Text = "第七套";
            }
            if (Properties.Settings.Default.numtitle == 8)
            {
                for (int i = 0; i < 7; i++)
                {
                    timu[i] = xuanze[i + 49];
                }
                for (int i = 0; i < 18; i++)
                {
                    timu[i + 7] = panduan[i + 126];
                }
                for (int i = 0; i < 5; i++)
                {
                    timu[i + 25] = tiankong[i + 35];
                }
                label_timu.Text = timu[0];
                tem1 = xzxx8;

                c1.Text = tem1[0, 0];
                c2.Text = tem1[0, 1];
                c3.Text = tem1[0, 2];
                c4.Text = tem1[0, 3];
                labeltitle.Text = "第八套";
            }
            if (Properties.Settings.Default.numtitle == 9)
            {
                for (int i = 0; i < 7; i++)
                {
                    timu[i] = xuanze[i + 56];
                }
                for (int i = 0; i < 18; i++)
                {
                    timu[i + 7] = panduan[i + 144];
                }
                for (int i = 0; i < 5; i++)
                {
                    timu[i + 25] = tiankong[i + 40];
                }
                label_timu.Text = timu[0];
                tem1 = xzxx9;

                c1.Text = tem1[0, 0];
                c2.Text = tem1[0, 1];
                c3.Text = tem1[0, 2];
                c4.Text = tem1[0, 3];
                labeltitle.Text = "第九套";
            }
            if (Properties.Settings.Default.numtitle == 10)
            {
                for (int i = 0; i < 7; i++)
                {
                    timu[i] = xuanze[i + 63];
                }
                for (int i = 0; i < 18; i++)
                {
                    timu[i + 7] = panduan[i + 162];
                }
                for (int i = 0; i < 5; i++)
                {
                    timu[i + 25] = tiankong[i +45];
                }
                label_timu.Text = timu[0];
                tem1 = xzxx10;
                for (int i = 0; i < 45; i++)
                { jilu[i] = ""; }
                jilu[45] = "0";
                c1.Text = tem1[0, 0];
                c2.Text = tem1[0, 1];
                c3.Text = tem1[0, 2];
                c4.Text = tem1[0, 3];
                labeltitle.Text = "第十套";
            }

   









        }
        string addr = "";
        void read_ini()
        {
           
            if (File.Exists(addr))
            {
                StreamReader sr = new StreamReader(addr);
                for (int i = 0; i < 46;i++ )
                {
                    jilu[i] = sr.ReadLine();
                }
               
                sr.Close();        //关闭当前的StreamReader对象和基础流
            }
            else
            {
              //  File.Create(addr);
                File.Create(addr).Dispose();
               // WriteIni();
               

            }
           
        
        }
         
         void WriteIni() // 写入ini文件
         {
             try
             {
                 string adas = Application.StartupPath + "\\data\\" + Properties.Settings.Default.username + "_" + flag11 + ".ini";
                 StreamWriter s = new StreamWriter(addr, false);//定义一个以一种特定的编码向流中写入数据对象

                 for (int i = 0; i < 46; i++)
                 {
                     s.WriteLine(jilu[i]);
                 }

                 s.Flush(); //清理当前编写器的所有缓冲区，并使所有缓冲数据写入基础流
                 s.Close(); //关闭当前的StreamWriter对象和基础流
             }
             catch (Exception ex)
             {
                 MessageBox.Show(ex.ToString());
             }
         }
     
  
        void pddc()//提交之后判断对错
        {
            read_ini();

            if (!jilu[0].Equals(daan[flag11, 0].ToString()))
            {
                label1.BackColor = Color.Red;

            }
            else
            {
                label1.BackColor = Color.Green;
            }

            if (!jilu[1].Equals(daan[flag11, 1].ToString()))
            { 
                label2.BackColor = Color.Red;
               
            
            }
            else
            {
                label2.BackColor = Color.Green;
            }

            if (!jilu[2].Equals(daan[flag11, 2].ToString()))
            { 
                label3.BackColor = Color.Red;
               
            }
            else
            {
                label3.BackColor = Color.Green;
            }
            if (!jilu[3].Equals(daan[flag11, 3].ToString()))
            { 
                label4.BackColor = Color.Red;


            }
            else
            {
                label4.BackColor = Color.Green;
            }

            if (!jilu[4].Equals(daan[flag11, 4].ToString()))
            { 
                label5.BackColor = Color.Red;
                
            }
            else
            {
                label5.BackColor = Color.Green;
            }
            if (!jilu[5].Equals(daan[flag11, 5].ToString()))
            { 
                label6.BackColor = Color.Red;
               
            
            }
            else
            {
                label6.BackColor = Color.Green;
            }
            if (!jilu[6].Equals(daan[flag11, 6].ToString()))
            {
                label7.BackColor = Color.Red;
                
            }
            else
            {
                label7.BackColor = Color.Green;
            }
            if (!jilu[7].Equals(daan[flag11, 7].ToString()))
            { 
                label8.BackColor = Color.Red;
                label31.Text="";


            }
            else
            {
                label8.BackColor = Color.Green;
            }

            if (!jilu[8].Equals(daan[flag11, 8].ToString()))
            { 
                label9.BackColor = Color.Red;
               label31.Text="";
            }
            else
            {
                label9.BackColor = Color.Green;
            }
            if (!jilu[9].Equals(daan[flag11, 9].ToString()))
            { 
                label10.BackColor = Color.Red;
               label31.Text="";
            }
            else
            {
                label10.BackColor = Color.Green;
            }
            if (!jilu[10].Equals(daan[flag11, 10].ToString()))
            { 
                label11.BackColor = Color.Red;
              label31.Text="";

            }
            else
            {
                label11.BackColor = Color.Green;
            }

            if (!jilu[11].Equals(daan[flag11, 11].ToString()))
            { 
                label12.BackColor = Color.Red;
             label31.Text="";
            }
            else
            {
                label12.BackColor = Color.Green;
            }
            if (!jilu[12].Equals(daan[flag11, 12].ToString()))
            { 
                label13.BackColor = Color.Red;
               label31.Text="";
            }
            else
            {
                label13.BackColor = Color.Green;
            }
            if (!jilu[13].Equals(daan[flag11, 13].ToString()))
            {
                label14.BackColor = Color.Red;
               label31.Text="";
            
            }
            else
            {
                label4.BackColor = Color.Green;
            }
            if (!jilu[14].Equals(daan[flag11, 14].ToString()))
            { 
                label15.BackColor = Color.Red;
              label31.Text="";
            }
            else
            {
                label15.BackColor = Color.Green;
            }
            if (!jilu[15].Equals(daan[flag11, 15].ToString()))
            { 
                
                label16.BackColor = Color.Red;
              label31.Text="";
            }
            else
            {
                label6.BackColor = Color.Green;
            }
            if (!jilu[16].Equals(daan[flag11, 16].ToString()))
            { 
                
                label17.BackColor = Color.Red;
                label31.Text="";
            }
            else
            {
                label17.BackColor = Color.Green;
            }
            if (!jilu[17].Equals(daan[flag11, 17].ToString()))
            {
                
                label18.BackColor = Color.Red;
               label31.Text="";

            }
            else
            {
                label18.BackColor = Color.Green;
            }

            if (!jilu[18].Equals(daan[flag11, 18].ToString()))
            { 
                
                label19.BackColor = Color.Red;
               label31.Text="";
            }
            else
            {
                label9.BackColor = Color.Green;
            }

            if (!jilu[19].Equals(daan[flag11, 19].ToString()))
            { 
                
                label20.BackColor = Color.Red;

               label31.Text="";
            }
            else
            {
                label20.BackColor = Color.Green;
            }
            if (!jilu[20].Equals(daan[flag11, 20].ToString()))
            { 
                
                label21.BackColor = Color.Red;
             label31.Text="";
            }
            else
            {
                label21.BackColor = Color.Green;
            }
            if (!jilu[21].Equals(daan[flag11, 21].ToString()))
            { 
                
                label22.BackColor = Color.Red;
                label31.Text="";
            }
            else
            {
                label22.BackColor = Color.Green;
            }
            if (!jilu[22].Equals(daan[flag11, 22].ToString()))
            { 
                label23.BackColor = Color.Red;

               label31.Text="";
            }
            else
            {
                label23.BackColor = Color.Green;
            }
            if (!jilu[23].Equals(daan[flag11, 23].ToString()))
            { 
                label24.BackColor = Color.Red;
               label31.Text="";
            }
            else
            {
                label24.BackColor = Color.Green;
            }
            if (!jilu[24].Equals(daan[flag11, 24].ToString()))
            { 
                label25.BackColor = Color.Red;

               label31.Text="";



            }
            else
            {
                label25.BackColor = Color.Green;
            }

            if(!(jilu[25].Equals(dxdaan[flag11,0])&&jilu[26].Equals(dxdaan[flag11,1])&&jilu[27].Equals(dxdaan[flag11,2])&&jilu[28].Equals(dxdaan[flag11,3])))
            {
                label26.BackColor = Color.Red;



            }
            else
            {
                label26.BackColor = Color.Green;
            }
            if(!(jilu[29].Equals(dxdaan[flag11,4])&&jilu[30].Equals(dxdaan[flag11,5])&&jilu[31].Equals(dxdaan[flag11,6])&&jilu[32].Equals(dxdaan[flag11,7])))
            {
                label27.BackColor = Color.Red;

            }
            else
            {
                label27.BackColor = Color.Green;
            }
            if(!(jilu[33].Equals(dxdaan[flag11,8])&&jilu[34].Equals(dxdaan[flag11,9])&&jilu[35].Equals(dxdaan[flag11,10])&&jilu[36].Equals(dxdaan[flag11,11])))
            {
                label28.BackColor = Color.Red;

            }
            else
            {
                label28.BackColor = Color.Green;
            }
            if(!(jilu[37].Equals(dxdaan[flag11,12])&&jilu[38].Equals(dxdaan[flag11,13])&&jilu[39].Equals(dxdaan[flag11,14])&&jilu[40].Equals(dxdaan[flag11,15])))
            {
                label29.BackColor = Color.Red;


            }
            else
            {
                label29.BackColor = Color.Green;
            }
            if(!(jilu[41].Equals(dxdaan[flag11,16])&&jilu[42].Equals(dxdaan[flag11,17])&&jilu[43].Equals(dxdaan[flag11,18])&&jilu[44].Equals(dxdaan[flag11,19])))
            {
                label30.BackColor = Color.Red;


            }
            else
            {
                label30.BackColor = Color.Green;
            }

        
        }

        String[] jilu = { "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                            "", "", "", "", "", "", "", "", "", "", "", "", "", "", "","0" };
      
        int fljl =0;
        void jlda(int i) 
        {Label[] lab = { label1, label2, label3, label4, label5, label6, label7, label8, label9, label10, label11, label12, label13, label14, label15, 
                              label16, label17, label18, label19, label20 
                          , label21, label22, label23, label24, label25, label26, label27, label28, label9, label30 };
            if (i <= 24)
            {
                if (c1.Checked == true)
                {
                    jilu[i] = "1";
                    if(!jilu[45].Equals("1"))
                        lab[i].BackColor = Color.Blue;
                }
                else if (c2.Checked == true)
                {
                    jilu[i] = "2";
                    if (!jilu[45].Equals("1"))
                        lab[i].BackColor = Color.Blue;
                }
                else if (c3.Checked == true)
                {
                    jilu[i] = "3";
                    if (!jilu[45].Equals("1"))
                        lab[i].BackColor = Color.Blue;
                }
                else if (c4.Checked == true)
                {
                    jilu[i] = "4";
                    if (!jilu[45].Equals("1"))
                        lab[i].BackColor = Color.Blue;
                }
                else
                {
                    jilu[i] = "0";
                }

                c1.Checked = false;
                c2.Checked = false;
                c3.Checked = false;
                c4.Checked = false;
            }
            if(i==25) 
            {
                jilu[25] = textBox1.Text;
                jilu[26] = textBox2.Text;
                jilu[27] = textBox3.Text;
                jilu[28] = textBox4.Text;
                if (!jilu[45].Equals("1"))
                {
                    if (textBox1.Text != "" || textBox2.Text != "" || textBox3.Text != "" || textBox4.Text != "")
                        lab[i].BackColor = Color.Blue;
                }

            }
            if (i == 26)
            {
                jilu[29] = textBox1.Text;
                jilu[30] = textBox2.Text;
                jilu[31] = textBox3.Text;
                jilu[32] = textBox4.Text;
                if (!jilu[45].Equals("1"))
                {
                    if (textBox1.Text != "" || textBox2.Text != "" || textBox3.Text != "" || textBox4.Text != "")
                        lab[i].BackColor = Color.Blue;
                }
            }
            if (i == 27)
            {
                jilu[33] = textBox1.Text;
                jilu[34] = textBox2.Text;
                jilu[35] = textBox3.Text;
                jilu[36] = textBox4.Text;
                if (!jilu[45].Equals("1"))
                {
                    if (textBox1.Text != "" || textBox2.Text != "" || textBox3.Text != "" || textBox4.Text != "")
                        lab[i].BackColor = Color.Blue;
                }
            }
            if (i == 28)
            {
                jilu[37] = textBox1.Text;
                jilu[38] = textBox2.Text;
                jilu[39] = textBox3.Text;
                jilu[40] = textBox4.Text;
                if (!jilu[45].Equals("1"))
                {
                    if (textBox1.Text != "" || textBox2.Text != "" || textBox3.Text != "" || textBox4.Text != "")
                        lab[i].BackColor = Color.Blue;
                }
            }
            if (i == 29)
            {
                jilu[41] = textBox1.Text;
                jilu[42] = textBox2.Text;
                jilu[43] = textBox3.Text;
                jilu[44] = textBox4.Text;
                if (!jilu[45].Equals("1"))
                {
                    if (textBox1.Text != "" || textBox2.Text != "" || textBox3.Text != "" || textBox4.Text != "")
                        lab[i].BackColor = Color.Blue;
                }
            }
          


        
        }

        void memory1(int i)
        {
            if (i <= 24)
            {
                if ("1".Equals(jilu[i]))
                { c1.Checked = true; }
                else if ("2".Equals(jilu[i]))
                { c2.Checked = true; }
                else if ("3".Equals(jilu[i]))
                { c3.Checked = true; }
                else if ("4".Equals(jilu[i]))
                { c4.Checked = true; }
                else
                {
                    c1.Checked = false;
                    c2.Checked = false;
                    c3.Checked = false;
                    c4.Checked = false;
                }

            }
            if (i == 25)
            { 
                textBox1.Text = jilu[25];
                textBox2.Text = jilu[26];
                textBox3.Text = jilu[27];
                textBox4.Text = jilu[28];
            }
            if (i == 26)
            {
                textBox1.Text = jilu[29];
                textBox2.Text = jilu[30];
                textBox3.Text = jilu[31];
                textBox4.Text = jilu[32];
            }
            if (i == 27)
            {
                textBox1.Text = jilu[33];
                textBox2.Text = jilu[34];
                textBox3.Text = jilu[35];
                textBox4.Text = jilu[36];
            }
            if (i == 28)
            {
                textBox1.Text = jilu[37];
                textBox2.Text = jilu[38];
                textBox3.Text = jilu[39];
                textBox4.Text = jilu[40];
            }
            if (i == 29)
            {
                textBox1.Text = jilu[41];
                textBox2.Text = jilu[42];
                textBox3.Text = jilu[43];
                textBox4.Text = jilu[44];
            }
            
          


        }


        private void panel32_Click(object sender, EventArgs e)//返回
        {
            jlda(fljl);
          
            WriteIni();
            this.Dispose();
            Test tes = new Test();
            tes.ShowDialog();
           

        }
        void showanswer() { 
            label1.Visible = true;
            label2.Visible = true;
            label3.Visible = true;
            label4.Visible = true;
            label5.Visible = true;
            label6.Visible = true;
            label7.Visible = true;
            label8.Visible = true;
            label9.Visible = true;
            label10.Visible = true;
            label11.Visible = true;
            label12.Visible = true;
            label13.Visible = true;
            label14.Visible = true;
            label15.Visible = true;
            label16.Visible = true;
            label17.Visible = true;
            label18.Visible = true;
            label19.Visible = true;
            label20.Visible = true;
            label21.Visible = true;
            label22.Visible = true;
            label23.Visible = true;
            label24.Visible = true;
            label25.Visible = true;
            label26.Visible = true;
            label27.Visible = true;
            label28.Visible = true;
            label29.Visible = true;
            label30.Visible = true;
            label31.Visible = true;
            
        
        }
        void showsjans() {
            if (!jilu[0].Equals(daan[10, 0].ToString()))
            {
                label1.BackColor = Color.Red;
            
            }
            if (!jilu[1].Equals(daan[10, 1].ToString()))
            {
                label2.BackColor = Color.Red;

            }
            if (!jilu[2].Equals(daan[10, 2].ToString()))
            {
                label3.BackColor = Color.Red;

            }
            if (!jilu[3].Equals(daan[10, 3].ToString()))
            {
                label4.BackColor = Color.Red;

            }
            if (!jilu[4].Equals(daan[10, 4].ToString()))
            {
                label5.BackColor = Color.Red;

            }
            if (!jilu[5].Equals(daan[10, 5].ToString()))
            {
                label6.BackColor = Color.Red;

            }
            if (!jilu[6].Equals(daan[10, 6].ToString()))
            {
                label7.BackColor = Color.Red;

            }
            if (!jilu[7].Equals(daan[10, 7].ToString()))
            {
                label8.BackColor = Color.Red;

            }
            if (!jilu[8].Equals(daan[10, 8].ToString()))
            {
                label9.BackColor = Color.Red;

            }
            if (!jilu[9].Equals(daan[10, 9].ToString()))
            {
                label10.BackColor = Color.Red;

            }
            if (!jilu[10].Equals(daan[10, 10].ToString()))
            {
                label11.BackColor = Color.Red;

            }
            if (!jilu[11].Equals(daan[10, 11].ToString()))
            {
                label12.BackColor = Color.Red;

            }
            if (!jilu[12].Equals(daan[10, 12].ToString()))
            {
                label13.BackColor = Color.Red;

            }
            if (!jilu[13].Equals(daan[10, 13].ToString()))
            {
                label14.BackColor = Color.Red;

            }
            if (!jilu[14].Equals(daan[10, 14].ToString()))
            {
                label15.BackColor = Color.Red;

            }
            if (!jilu[15].Equals(daan[10, 15].ToString()))
            {
                label16.BackColor = Color.Red;

            }
            if (!jilu[16].Equals(daan[10, 16].ToString()))
            {
                label17.BackColor = Color.Red;

            }
            if (!jilu[17].Equals(daan[10, 17].ToString()))
            {
                label18.BackColor = Color.Red;

            }
            if (!jilu[18].Equals(daan[10, 18].ToString()))
            {
                label19.BackColor = Color.Red;

            }
            if (!jilu[19].Equals(daan[10, 19].ToString()))
            {
                label20.BackColor = Color.Red;
            }
            if (!jilu[20].Equals(daan[10, 20].ToString()))
            {
                label21.BackColor = Color.Red;
            }
            if (!jilu[21].Equals(daan[10, 21].ToString()))
            {
                label22.BackColor = Color.Red;
            }
            if (!jilu[22].Equals(daan[10, 22].ToString()))
            {
                label23.BackColor = Color.Red;
            }
            if (!jilu[23].Equals(daan[10, 23].ToString()))
            {
                label24.BackColor = Color.Red;
            }
            if (!jilu[24].Equals(daan[10, 24].ToString()))
            {
                label25.BackColor = Color.Red;
            }

            if (!(jilu[25].Equals(dxdaan[10, 0]) && jilu[25].Equals(dxdaan[10, 1]) && jilu[25].Equals(dxdaan[10, 2]) && jilu[25].Equals(dxdaan[10, 3])))
            {
                label26.BackColor = Color.Red;
            }
            if (!(jilu[25].Equals(dxdaan[10, 0]) && jilu[25].Equals(dxdaan[10, 1]) && jilu[25].Equals(dxdaan[10, 2]) && jilu[25].Equals(dxdaan[10, 3])))
            {
                label27.BackColor = Color.Red;
            }
            if (!(jilu[25].Equals(dxdaan[10, 0]) && jilu[25].Equals(dxdaan[10, 1]) && jilu[25].Equals(dxdaan[10, 2]) && jilu[25].Equals(dxdaan[10, 3])))
            {
                label28.BackColor = Color.Red;
            }
            if (!(jilu[25].Equals(dxdaan[10, 0]) && jilu[25].Equals(dxdaan[10, 1]) && jilu[25].Equals(dxdaan[10, 2]) && jilu[25].Equals(dxdaan[10, 3])))
            {
                label29.BackColor = Color.Red;
            }
            if (!(jilu[25].Equals(dxdaan[10, 0]) && jilu[25].Equals(dxdaan[10, 1]) && jilu[25].Equals(dxdaan[10, 2]) && jilu[25].Equals(dxdaan[10, 3])))
            {
                label30.BackColor = Color.Red;
            }
















        
        
        }
        private void panel31_Click(object sender, EventArgs e)//提交按钮
        {
            if (flag11 == 10)
            {
                jlda(fljl);
                showanswer();
                showsjans();
                c1.AutoCheck = false;
                c2.AutoCheck = false;
                c3.AutoCheck = false;
                c4.AutoCheck = false;

                textBox1.ReadOnly = true;
                textBox2.ReadOnly = true;
                textBox3.ReadOnly = true;
                textBox4.ReadOnly = true;
            }
            else
            {
                jlda(fljl);
                showanswer();
                jilu[45] = "1";
                WriteIni();
                this.Dispose();
                TestTitle tet = new TestTitle();
                tet.ShowDialog();
            }
           
        }

        private void panel1_Click(object sender, EventArgs e)
        {
           
             label_timu.Text = timu[0];
             c1.Text=tem1[0,0];
             c2.Text = tem1[0, 1];
             c3.Text = tem1[0, 2];
             c4.Text = tem1[0, 3];
             c1.Visible = true;
             c2.Visible = true;
             c3.Visible = true;
             c4.Visible = true;
           
             textBox1.Visible = false;
             textBox2.Visible = false;
             textBox3.Visible = false;
             textBox4.Visible = false;
             jlda(fljl);
             fljl = 0;
             memory1(fljl);

             if (daan[flag11, 0] == 1)
             { label31.Text = "正确答案为A:"; }
             if (daan[flag11, 0] == 2)
             { label31.Text = "正确答案为B:"; }
             if (daan[flag11, 0] == 3)
             { label31.Text = "正确答案为C:"; }
             if (daan[flag11, 0] == 4)
             { label31.Text = "正确答案为D:"; }

        }

        private void panel2_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[1];
            c1.Text = tem1[1, 0];
            c2.Text = tem1[1, 1];
            c3.Text = tem1[1, 2];
            c4.Text = tem1[1, 3];
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible = true;
            c4.Visible = true;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;


            jlda(fljl);
            fljl = 1;
            memory1(fljl);

            if (daan[flag11, 1] == 1)
            { label31.Text = "正确答案为A:"; }
            if (daan[flag11, 1] == 2)
            { label31.Text = "正确答案为B:"; }
            if (daan[flag11, 1] == 3)
            { label31.Text = "正确答案为C:"; }
            if (daan[flag11, 1] == 4)
            { label31.Text = "正确答案为D:"; }
            
        }

        private void panel3_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[2];
            c1.Text = tem1[2, 0];
             c2.Text = tem1[2, 1];
             c3.Text = tem1[2, 2];
            c4.Text = tem1[2, 3];
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible = true;
            c4.Visible = true;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;


            jlda(fljl);
            fljl = 2;
            memory1(fljl);

            if (daan[flag11, 2] == 1)
            { label31.Text = "正确答案为A:"; }
            if (daan[flag11, 2] == 2)
            { label31.Text = "正确答案为B:"; }
            if (daan[flag11, 2] == 3)
            { label31.Text = "正确答案为C:"; }
            if (daan[flag11, 2] == 4)
            { label31.Text = "正确答案为D:"; }
            
        }

        private void panel4_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[3];
            c1.Text = tem1[3, 0];
            c2.Text = tem1[3, 1];
            c3.Text = tem1[3, 2];
            c4.Text = tem1[3, 3];
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible = true;
            c4.Visible = true;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 3;
            memory1(fljl);

            if (daan[flag11, 3] == 1)
            { label31.Text = "正确答案为A:"; }
            if (daan[flag11, 3] == 2)
            { label31.Text = "正确答案为B:"; }
            if (daan[flag11, 3] == 3)
            { label31.Text = "正确答案为C:"; }
            if (daan[flag11, 3] == 4)
            { label31.Text = "正确答案为D:"; }
        }

        private void panel5_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[4];
            c1.Text = tem1[4, 0];
            c2.Text = tem1[4, 1];
            c3.Text = tem1[4, 2];
            c4.Text = tem1[4, 3];
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible = true;
            c4.Visible = true;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 4;
            memory1(fljl);

            if (daan[flag11, 4] == 1)
            { label31.Text = "正确答案为A:"; }
            if (daan[flag11, 4] == 2)
            { label31.Text = "正确答案为B:"; }
            if (daan[flag11, 4] == 3)
            { label31.Text = "正确答案为C:"; }
            if (daan[flag11, 4] == 4)
            { label31.Text = "正确答案为D:"; }
        }

        private void panel6_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[5];
            c1.Text = tem1[5, 0];
            c2.Text = tem1[5, 1];
            c3.Text = tem1[5, 2];
            c4.Text = tem1[5, 3];
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible = true;
            c4.Visible = true;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 5;
            memory1(fljl);

            if (daan[flag11, 5] == 1)
            { label31.Text = "正确答案为A:"; }
            if (daan[flag11, 5] == 2)
            { label31.Text = "正确答案为B:"; }
            if (daan[flag11, 5] == 3)
            { label31.Text = "正确答案为C:"; }
            if (daan[flag11, 5] == 4)
            { label31.Text = "正确答案为D:"; }
        }

        private void panel7_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[6];
            c1.Text = tem1[6, 0];
            c2.Text = tem1[6, 1];
            c3.Text = tem1[6, 2];
            c4.Text = tem1[6, 3];
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible = true;
            c4.Visible = true;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 6;
            memory1(fljl);

            if (daan[flag11, 6] == 1)
            { label31.Text = "正确答案为A:"; }
            if (daan[flag11, 6] == 2)
            { label31.Text = "正确答案为B:"; }
            if (daan[flag11, 6] == 3)
            { label31.Text = "正确答案为C:"; }
            if (daan[flag11, 6] == 4)
            { label31.Text = "正确答案为D:"; }
            
        }

        private void panel8_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[7];
            c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;
            jlda(fljl);
            fljl = 7;
            memory1(fljl);

            if (daan[flag11, 7].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 7].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }



          
        }

        private void panel9_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[8];
            c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 8;
            memory1(fljl);
            if (daan[flag11, 8].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 8].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel10_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[9];
           c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 9;
            memory1(fljl);
            if (daan[flag11, 9].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 9].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel11_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[10];
            c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 10;
            memory1(fljl);
            if (daan[flag11, 10].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 10].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel12_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[11];
          c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 11;
            memory1(fljl);

            if (daan[flag11, 11].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 11].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel13_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[12];
           c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 12;
            memory1(fljl);

            if (daan[flag11, 12].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 12].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel14_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[13];
            c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 13;
            memory1(fljl);

            if (daan[flag11, 13].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 13].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel15_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[14];
            c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 14;
            memory1(fljl);

            if (daan[flag11, 14].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 14].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel16_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[15];
          c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 15;
            memory1(fljl);
            if (daan[flag11, 15].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 15].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel17_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[16];
           c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 16;
            memory1(fljl);

            if (daan[flag11, 16].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 16].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel18_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[17];
           c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 17;
            memory1(fljl);

            if (daan[flag11, 17].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 17].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel19_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[18];
            c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 18;
            memory1(fljl);

            if (daan[flag11, 18].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 18].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel20_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[19];
           c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 19;
            memory1(fljl);

            if (daan[flag11, 19].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 19].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel21_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[20];
           c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 20;
            memory1(fljl);
            if (daan[flag11, 20].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 20].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel22_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[21];
            c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;

            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 21;
            memory1(fljl);

            if (daan[flag11, 21].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 21].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel23_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[22];
            c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;
            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 22;
            memory1(fljl);

            if (daan[flag11, 22].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 22].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel24_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[23];
           c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;
            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 23;
            memory1(fljl);

            if (daan[flag11, 23].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 23].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }


        }

        private void panel25_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[24];
            c1.Text="正确";
            c2.Text="错误";
            c1.Visible = true;
            c2.Visible = true;
            c3.Visible=false;
            c4.Visible=false;
            textBox1.Visible = false;
            textBox2.Visible = false;
            textBox3.Visible = false;
            textBox4.Visible = false;

            jlda(fljl);
            fljl = 24;
            memory1(fljl);

            if (daan[flag11, 24].ToString().Equals("1"))
            {
                label31.Text = "答案为:正确";
            }
            if (daan[flag11, 24].ToString().Equals("2"))
            {
                label31.Text = "答案为:错误";
            }

        }

        private void panel26_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[25];

            c1.Visible = false;
            c2.Visible = false;
            c3.Visible = false;
            c4.Visible = false;
            if (flag11 == 0)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = false;
            }

            if (flag11 == 1)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 2)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 3)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 4)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 5)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 6)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 7)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 8)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 9)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 10)
            {
                if (tkasd[0] == 1)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = false;
                    textBox3.Visible = false;
                    textBox4.Visible = false;
                }
                if (tkasd[0] == 2)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = false;
                    textBox4.Visible = false;
                }
                if (tkasd[0] == 3)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = true;
                    textBox4.Visible = false;
                }
                if (tkasd[0] == 4)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = true;
                    textBox4.Visible = true;
                }
            
            
            }





            jlda(fljl);
            fljl = 25;
            memory1(fljl);


            label31.Text = dxdaan[flag11, 0] + "     " + dxdaan[flag11, 1] + "     " + dxdaan[flag11, 2] + "     " + dxdaan[flag11, 3];
        }

        private void panel27_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[26];
            c1.Visible = false;
            c2.Visible = false;
            c3.Visible = false;
            c4.Visible = false;
            if (flag11 == 0)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = false;
            }
            if (flag11 == 1)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 2)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 3)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 4)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 5)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 6)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 7)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 8)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = false;
            }
            if (flag11 == 9)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 10)
            {
                if (tkasd[1] == 1)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = false;
                    textBox3.Visible = false;
                    textBox4.Visible = false;
                }
                if (tkasd[1] == 2)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = false;
                    textBox4.Visible = false;
                }
                if (tkasd[1] == 3)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = true;
                    textBox4.Visible = false;
                }
                if (tkasd[1] == 4)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = true;
                    textBox4.Visible = true;
                }


            }
            jlda(fljl);
            fljl = 26;
            memory1(fljl);

            label31.Text = dxdaan[flag11, 4] + "     " + dxdaan[flag11, 5] + "     " + dxdaan[flag11, 6] + "     " + dxdaan[flag11, 7];
        }

        private void panel28_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[27];
            c1.Visible = false;
            c2.Visible = false;
            c3.Visible = false;
            c4.Visible = false;
            if (flag11 == 0)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 1)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 2)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 3)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 4)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 5)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 6)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 7)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 8)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = false;
            }
            if (flag11 == 9)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }

            if (flag11 == 10)
            {
                if (tkasd[2] == 1)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = false;
                    textBox3.Visible = false;
                    textBox4.Visible = false;
                }
                if (tkasd[2] == 2)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = false;
                    textBox4.Visible = false;
                }
                if (tkasd[2] == 3)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = true;
                    textBox4.Visible = false;
                }
                if (tkasd[2] == 4)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = true;
                    textBox4.Visible = true;
                }


            }
            jlda(fljl);
            fljl = 27;
            memory1(fljl);

            label31.Text = dxdaan[flag11, 8] + "     " + dxdaan[flag11, 9] + "     " + dxdaan[flag11, 10] + "     " + dxdaan[flag11, 11];
        }

        private void panel29_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[28];
            c1.Visible = false;
            c2.Visible = false;
            c3.Visible = false;
            c4.Visible = false;
            if (flag11 == 0)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 1)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = false;
            }
            if (flag11 == 2)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = false;
            }
            if (flag11 == 3)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 4)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 5)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 6)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 7)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = true;
            }
            if (flag11 == 8)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 9)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = false;
            }

            if (flag11 == 10)
            {
                if (tkasd[3] == 1)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = false;
                    textBox3.Visible = false;
                    textBox4.Visible = false;
                }
                if (tkasd[3] == 2)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = false;
                    textBox4.Visible = false;
                }
                if (tkasd[3] == 3)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = true;
                    textBox4.Visible = false;
                }
                if (tkasd[3] == 4)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = true;
                    textBox4.Visible = true;
                }


            }

            jlda(fljl);
            fljl = 28;
            memory1(fljl);


            label31.Text = dxdaan[flag11, 12] + "     " + dxdaan[flag11, 13] + "     " + dxdaan[flag11, 14] + "     " + dxdaan[flag11, 15];
        }

        private void panel30_Click(object sender, EventArgs e)
        {
            label_timu.Text = timu[29];
            c1.Visible = false;
            c2.Visible = false;
            c3.Visible = false;
            c4.Visible = false;

            if (flag11 == 0)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 1)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 2)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 3)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = false;
            }
            if (flag11 == 4)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 5)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 6)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 7)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 8)
            {
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }
            if (flag11 == 9)
            {
                textBox1.Visible = true;
                textBox2.Visible = false;
                textBox3.Visible = false;
                textBox4.Visible = false;
            }

            if (flag11 == 10)
            {
                if (tkasd[4] == 1)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = false;
                    textBox3.Visible = false;
                    textBox4.Visible = false;
                }
                if (tkasd[4] == 2)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = false;
                    textBox4.Visible = false;
                }
                if (tkasd[4] == 3)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = true;
                    textBox4.Visible = false;
                }
                if (tkasd[4] == 4)
                {
                    textBox1.Visible = true;
                    textBox2.Visible = true;
                    textBox3.Visible = true;
                    textBox4.Visible = true;
                }


            }


            jlda(fljl);
            fljl = 29;
            memory1(fljl);


            label31.Text = dxdaan[flag11, 16] + "     " + dxdaan[flag11, 17] + "     " + dxdaan[flag11, 18] + "     " + dxdaan[flag11, 19];

        }

        private void TestTitle_FormClosed(object sender, FormClosedEventArgs e)
        {
            jlda(fljl);
            WriteIni();

            to_time = Convert.ToDouble(temtime);
            close1 = DateTime.Now;
            string sspt = (close1 - open1).TotalMinutes.ToString();
            int count_time = sspt.LastIndexOf(".");
            sspt = sspt.Substring(0, count_time + 3);
            to_time += Convert.ToDouble(sspt);

            WriteIni2(to_time.ToString());
            Properties.Settings.Default.total_time = to_time.ToString();
            Properties.Settings.Default.Save();



        }



        /// <summary>
        /// 利用Hashtable
        /// </summary>
        static int[] UseHashTableToNonRepeatedRandom(int length, int minValue, int maxValue)
        {
            Hashtable hashtable = new Hashtable();
            int seed = Guid.NewGuid().GetHashCode();
            Random random = new Random(seed);
            for (int i = 0; hashtable.Count < length; i++)
            {
                int nValue = random.Next(minValue, maxValue);
                if (!hashtable.ContainsValue(nValue) && nValue != 0)
                {
                    hashtable.Add(i, nValue);
                    //hashtable.Add(nValue, nValue);        // 将 key 和 value设置成一样的值，导致hashtable无法按添加顺序输出数组
                    //Console.WriteLine(nValue.ToString());
                }
            }
            int[] array = new int[hashtable.Count];
            hashtable.Values.CopyTo(array, 0);
            return array;
        }


        string temuser = "";
        string addr2 = "";
        string temtime = "0";
        double to_time;
        DateTime open1;
        DateTime close1;

        private void ReadIni2() // 读取ini文件
        {
            try
            {
                if (File.Exists(addr2))
                {
                    //存在文件
                    StreamReader sr = new StreamReader(addr2);

                    temtime = sr.ReadLine();
                    Console.WriteLine(temtime);

                    sr.Close();        //关闭当前的StreamReader对象和基础流
                }
                else
                {
                    //不存在文件
                    //File.Create(addr);//创建该文件
                  //  MessageBox.Show("该用户首次登录");

                }

            }
            catch (Exception ex)
            {
                MessageBox.Show(ex.ToString());
            }
        }

        private void WriteIni2(string stime) // 写入ini文件
        {
            try
            {
                StreamWriter s = new StreamWriter(addr2, false);//定义一个以一种特定的编码向流中写入数据对象
                s.WriteLine(stime);
                s.Flush(); //清理当前编写器的所有缓冲区，并使所有缓冲数据写入基础流
                s.Close(); //关闭当前的StreamWriter对象和基础流
            }
            catch (Exception ex)
            {
                MessageBox.Show(ex.ToString());
            }
        }
        int zqscore = 0;

 

        void writexzt(StreamWriter sw, String timu1_1,String a, String b, String c, String d, String daan_1, String xx_1)
        {
          
            sw.WriteLine("<section class=\"multipleChoice\" style=\"padding: 10px;\" >");
            sw.WriteLine("<section style=\"margin-bottom: 7px;\">");
            sw.WriteLine("  <strong>" + timu1_1 + xx_1 + "</strong>");
            sw.WriteLine("  </section>");
            sw.WriteLine("<section style=\"margin-left: 13px\">");
            sw.WriteLine(" <section style=\"margin-bottom: 4px\">");
            sw.WriteLine("   <text style=\"line-height: 30px\">");
            sw.WriteLine(a);
            sw.WriteLine("</text>");
            sw.WriteLine("</section>");
            sw.WriteLine(" <section style=\"margin-bottom: 4px\">");
            sw.WriteLine(" <text style=\"line-height: 30px\">");
            sw.WriteLine(b);
            sw.WriteLine("  </text>");

            sw.WriteLine("</section>");
            sw.WriteLine("<section style=\"margin-bottom: 4px\">");
            sw.WriteLine(" <text style=\"line-height: 30px\">");
            sw.WriteLine(c);
            sw.WriteLine(" </text>");
            sw.WriteLine("  </section>");

            sw.WriteLine(" <section style=\"margin-bottom: 4px\">");
            sw.WriteLine(" <text style=\"line-height: 30px\">");
            sw.WriteLine(d);
            sw.WriteLine(" </text>");
            sw.WriteLine(" </section>");
            sw.WriteLine(" <section style=\"margin-bottom: 4px\">");
            sw.WriteLine(" <text style=\"line-height: 30px\">");
            sw.WriteLine("正确选项为:"+daan_1);
            sw.WriteLine(" </text>");
            sw.WriteLine(" </section>");


            sw.WriteLine(" </section>");
            sw.WriteLine("</section>");

        }

        void writepdt(StreamWriter sw, String timu1_1, String daan_1, String xx_1) 
        {
          
            sw.WriteLine("<section class=\"binaryChoice\" style=\"padding: 10px\">");
            sw.WriteLine(" <section style=\"margin-bottom: 7px; \">");

            sw.WriteLine(" <strong>"+timu1_1+xx_1+"</strong>");
            sw.WriteLine("<br/>");
            sw.WriteLine("正确答案为:"+daan_1);
            sw.WriteLine("</section>");
            sw.WriteLine("</section>");


        }

        void writetkt(StreamWriter sw, String timu1_1, String daan1_1, String daan1_2, String daan1_3, String daan1_4, String xx_1,String xx_2,String xx_3,String xx_4) 
        {
            sw.WriteLine("<section class=\"blankFilling\" style=\"padding: 10px\">");
            sw.WriteLine(" <section style=\"margin-bottom: 7px; \">");
            sw.WriteLine("<strong>"+timu1_1+xx_1+" "+xx_2+" "+xx_3+" "+xx_4+"</strong>");
            sw.WriteLine("<br/>");
            sw.WriteLine("正确答案为:"+daan1_1+" "+daan1_2+" "+daan1_3+" "+daan1_4);
            sw.WriteLine(" </section>");
            sw.WriteLine("</section>");
            if (xx_1 == daan1_1 && xx_2 == daan1_2 && xx_3 == daan1_3 && xx_4 == daan1_4)
            {
                zqscore++;
            }

        
        
        }

        private void panel33_Click(object sender, EventArgs e)
        {
            //设置保存文件的格式
            saveFileDialog1.Filter = "文本文件(*.html)|*.html";

            saveFileDialog1.FileName = temuser + System.DateTime.Now;
            if (saveFileDialog1.ShowDialog() == DialogResult.OK)
            {
                //使用“另存为”对话框中输入的文件名实例化StreamWriter对象
                StreamWriter sw = new StreamWriter(saveFileDialog1.FileName, true);
                //向创建的文件中写入内容
                sw.WriteLine("");
                sw.WriteLine("<!doctype html>");
                sw.WriteLine("<html lang=\"en\">");
                sw.WriteLine("<head>");
                sw.WriteLine("<meta charset=\"UTF-8\">");
                sw.WriteLine("  <meta name=\"viewport\"");
                sw.WriteLine(" content=\"width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0\">");
                sw.WriteLine(" <meta http-equiv=\"X-UA-Compatible\" content=\"ie=edge\">");
                sw.WriteLine("<title>Document</title>");
                sw.WriteLine("</head>");
                sw.WriteLine("<body>");
                sw.WriteLine("<div>");
                sw.WriteLine("<h1 style=\"text-align:center\">随机测试</h1>");
                sw.WriteLine("</div>");
                sw.WriteLine("<div style=\"margin-left: 15%; width: 100% \">");




                for (int i = 0; i < 7; i++)
                {


                    if (daan[10, i] == 1)
                    {
                        if (jilu[i].Equals("1"))
                        {
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "A", "A");
                            zqscore++;

                        }
                        else if (jilu[i].Equals("2"))
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "A", "B");
                        else if (jilu[i].Equals("3"))
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "A", "C");
                        else if (jilu[i].Equals("4"))
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "A", "D");
                        else
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "A", "");

                    }
                    if (daan[10, i] == 2)
                    {

                        if (jilu[i].Equals("1"))
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "B", "A");
                        else if (jilu[i].Equals("2"))
                        {
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "B", "B");
                            zqscore++;
                        }
                        else if (jilu[i].Equals("3"))
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "B", "C");
                        else if (jilu[i].Equals("4"))
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "B", "D");
                        else
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "B", "");



                    }
                    if (daan[10, i] == 3)
                    {
                        if (jilu[i].Equals("1"))
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "C", "A");
                        else if (jilu[i].Equals("2"))
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "C", "B");
                        else if (jilu[i].Equals("3"))
                        { writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "C", "C"); zqscore++; }
                        else if (jilu[i].Equals("4"))
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "C", "D");
                        else
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "C", "");


                    }
                    if (daan[10, i] == 4)
                    {
                        if (jilu[i].Equals("1"))
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "D", "A");
                        else if (jilu[i].Equals("2"))
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "D", "B");
                        else if (jilu[i].Equals("3"))
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "D", "C");
                        else if (jilu[i].Equals("4"))
                        { writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "D", "D"); zqscore++; }
                        else
                            writexzt(sw, timu[i], sjxzxx[i, 0], sjxzxx[i, 1], sjxzxx[i, 2], sjxzxx[i, 3], "D", "");


                    }
                }
                for (int i = 0; i < 18; i++)
                {
                    /*sw.WriteLine(timu[i+7]);
                    if (daan[10, i+7] == 1)
                        sw.WriteLine("答案为:正确");
                    if (daan[10, i+7] == 2)
                        sw.WriteLine("答案为:错误");*/

                    if (daan[10, i + 7] == 1)
                    {
                        if (jilu[i + 7].Equals("1"))
                        { writepdt(sw, timu[i + 7], "正确", "正确"); zqscore++; }
                        else if (jilu[i + 7].Equals("2"))
                            writepdt(sw, timu[i + 7], "正确", "错误");
                        else
                            writepdt(sw, timu[i + 7], "正确", "");

                    }
                    if (daan[10, i + 7] == 2)
                    {
                        if (jilu[i + 7].Equals("1"))
                            writepdt(sw, timu[i + 7], "错误", "正确");
                        else if (jilu[i + 7].Equals("2"))
                        { writepdt(sw, timu[i + 7], "错误", "错误"); zqscore++; }
                        else
                            writepdt(sw, timu[i + 7], "错误", "");

                    }



                }
                for (int i = 0; i < 5; i++)
                {
                    /*  sw.WriteLine(timu[i + 25]);
                      sw.WriteLine(sjdxzq[sjtkt[i],0]);
                      sw.WriteLine(sjdxzq[sjtkt[i], 1]);
                      sw.WriteLine(sjdxzq[sjtkt[i], 2]);
                      sw.WriteLine(sjdxzq[sjtkt[i], 3]);*/

                    writetkt(sw, timu[i + 25], sjdxzq[sjtkt[i], 0], sjdxzq[sjtkt[i], 1], sjdxzq[sjtkt[i], 2], sjdxzq[sjtkt[i], 3], jilu[i * 4 + 25], jilu[i * 4 + 26], jilu[i * 4 + 27], jilu[i * 4 + 28]);


                }
                sw.WriteLine("</div>");
                sw.WriteLine("<div>");
                sw.WriteLine("    <h2 style=\"text-align:center\">正确：" + zqscore + "个</h2>");
                sw.WriteLine("</div>");
                sw.WriteLine("<div>");
                sw.WriteLine("    <h2 style=\"text-align:center\">错误：" + (30 - zqscore) + "个</h2>");
                sw.WriteLine("</div>");
                sw.WriteLine("</body>");
                sw.WriteLine("</html>");
                //关闭当前文件写入流
                sw.Close();

            }
        }

        private void TestTitle_Load(object sender, EventArgs e)
        {

        }

    
   




       
    }
}
